// Copyright (c) 2025 Ilya Fedorov
// SPDX-License-Identifier: MIT
// https://github.com/iljyxa/SharedQueryDesignerHRM

#Область ОписаниеПеременных

&НаСервере
Перем ОбработкаОбъект; // ВнешняяОбработка.КонструкторПредставленийЗарплатаКадры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработка = ОбработкаОбъект();
	ПолноеИмяОбработки = Обработка.Метаданные().ПолноеИмя();
	
	ПараметрыЗапуска = ПараметрыЗапуска();
	Если ПараметрыЗапуска.ПакетныйРежим Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		Если Не ЗначениеЗаполнено(ПараметрыЗапуска.КаталогВыгрузки) Тогда
			ВызватьИсключение НСтр("ru = 'Не указан каталог выгрузки'");
		КонецЕсли;
		
		ОписанияПредставлений = Обработка.ОписанияПредставленийПоКонфигурации();
		
		Обработка.ВыгрузитьПредставленияВJSON(ОписанияПредставлений, ПараметрыЗапуска.КаталогВыгрузки);

		Возврат;
			
	КонецЕсли;
	
	ОписаниеТипаВсеТипыПараметраПредставления = Обработка.ОписаниеТипаВсеТипыПараметраПредставления();
	
	ИнициализироватьОписанияПредставлений();
	
	Элементы.ПараметрыВидСравнения.РежимВыбораИзСписка = Истина;
	Для Каждого КлючИЗначение Из Обработка.ДоступныеВидыСравненияОтбора() Цикл
		//@skip-check typed-value-adding-to-untyped-collection
		Элементы.ПараметрыВидСравнения.СписокВыбора.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;

	ЗаполнитьСписокВыбораИсточникаДанных();
	
	Элементы.ФормаСброситьКэшОписанийПредставлений.Видимость = Обработка.МодульОбщегоНазначения().РежимОтладки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	РедактированиеТекстаПредставления = Ложь;
	ИдентификаторСтрокиПредставления = Неопределено;
	Если Не ПустаяСтрока(Параметры.ТекстЗапроса) Тогда
		РедактированиеТекстаПредставления = Истина;

		РезультатПомещения = ТекстЗапросаПредставленияВДанныеФормы(Параметры.ТекстЗапроса);
		Если Не РезультатПомещения.Успех Тогда
			ТекстПредупреждения = СтрШаблон("Не удалось разобрать текст запроса: %1", РезультатПомещения.ТекстОшибки);
			ПоказатьПредупреждение(Неопределено, ТекстПредупреждения, , "Ошибка при разборе текста запроса");
		Иначе
			ИдентификаторСтрокиПредставления = РезультатПомещения.ИдентификаторСтрокиПредставления;
			Элементы.Представления.ТекущаяСтрока = РезультатПомещения.ИдентификаторСтрокиПредставления;
		КонецЕсли;	
	КонецЕсли;
	
	Если ВладелецФормы <> Неопределено Тогда
		Если РедактированиеТекстаПредставления Тогда
			УстановитьРежимИзменения(ЭтотОбъект, ИдентификаторСтрокиПредставления);
		Иначе
			УстановитьРежимВставки(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредставления

&НаКлиенте
Процедура ПредставленияПриАктивизацииСтроки(Элемент)

	ОтключитьОбработчикОжидания("ПредставленияПослеАктивизацииСтроки");
	ПодключитьОбработчикОжидания("ПредставленияПослеАктивизацииСтроки", 0.1, Истина);

КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПредставленияПослеАктивизацииСтроки()
	
	// TODO: Перенести на сервер.
	Представление = Элементы.Представления.ТекущиеДанные;

	Если Представление = Неопределено Тогда
		ИдентификаторПредставления = Неопределено;
		Элементы.ГруппаПравая.Доступность = Ложь;
		ДоступныеЛевыеЗначенияОтбора.Очистить();
	Иначе
		ИдентификаторПредставления = Представление.ИдентификаторПредставления;
		Элементы.ГруппаПравая.Доступность = Истина;
		Элементы.ПредставленияИсточникДанных.Видимость = Представление.ЕстьИсточникДанных;
		Элементы.ПредставленияФильтр.Видимость = Представление.ЕстьФильтр;
		Элементы.ПредставленияФильтр.АвтоОтметкаНезаполненного = Представление.ФильтрОбязателен;
		Элементы.ПредставленияФильтр.ОтметкаНезаполненного = Представление.ФильтрОбязателен
															 И ПустаяСтрока(Представление.Фильтр);
		ДоступныеЛевыеЗначенияОтбора.ЗагрузитьЗначения(ДоступныеЛевыеЗначенияОтбораПредставления(ИдентификаторПредставления)); // Вызов сервера
	КонецЕсли;

	УстановитьОтборСтрок(Элементы.Поля, "ИдентификаторПредставления", ИдентификаторПредставления); // Вызов сервера
	УстановитьОтборСтрок(Элементы.Параметры, "ИдентификаторПредставления", ИдентификаторПредставления); // Вызов сервера

	УстановитьПодсказкуЗаполненияПолей();
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПредставленияИсточникДанныхПриИзменении(Элемент)
	ПредставленияИсточникДанныхПриИзмененииНаСервере();
	УстановитьПодсказкуЗаполненияПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоля

&НаКлиенте
Процедура ПоляПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторПредставления = Элементы.Представления.ТекущиеДанные.ИдентификаторПредставления;
		Элемент.ТекущиеДанные.Используется = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоляПриИзменении(Элемент)
	Значения = ДоступныеЛевыеЗначенияОтбораПредставления(Элементы.Представления.ТекущиеДанные.ИдентификаторПредставления);
	ДоступныеЛевыеЗначенияОтбора.ЗагрузитьЗначения(Значения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметры

&НаКлиенте
Процедура ПараметрыПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.Параметры.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Отбор Тогда
		Элементы.ПараметрыИмя.КнопкаВыбора = Истина;
	Иначе
		Элементы.ПараметрыИмя.КнопкаВыбора = Неопределено;
	КонецЕсли;

	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ПараметрыЗначение.СписокВыбора.Очистить();

		Для Каждого ЭлементСписка Из ТекущиеДанные.СписокВыбора Цикл
			Элементы.ПараметрыЗначение.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;

		Элементы.ПараметрыЗначение.РежимВыбораИзСписка = Элементы.ПараметрыЗначение.СписокВыбора.Количество() > 0;
	КонецЕсли;

	УстановитьСвойстваЭлементаЗначенияПараметра();

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Представление = Элементы.Представления.ТекущиеДанные;
		Элемент.ТекущиеДанные.Отбор = Представление.ДоступныОтборы;
		Элемент.ТекущиеДанные.ИдентификаторПредставления = Представление.ИдентификаторПредставления;
		Элемент.ТекущиеДанные.Используется = Истина;
		Элемент.ТекущиеДанные.ЗначениеЭтоВыражение = Истина;
		
		УстановитьСвойстваЭлементаЗначенияПараметра();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеЭтоВыражениеПриИзменении(Элемент)
	УстановитьСвойстваЭлементаЗначенияПараметра();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИмяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Элементы.Параметры.ТекущиеДанные.Отбор Тогда
		СтандартнаяОбработка = Ложь;

		ДанныеВыбора = Новый СписокЗначений;

		Для Каждого ЭлементСписка Из ДоступныеЛевыеЗначенияОтбора Цикл
			Если СтрНайти(ВРег(ЭлементСписка.Значение), ВРег(Текст)) > 0 Тогда
				ДанныеВыбора.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИмяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если Элементы.Параметры.ТекущиеДанные.Отбор Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ДоступныеЛевыеЗначенияОтбора;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеПриИзменении(Элемент)
	Элементы.Параметры.ТекущиеДанные.Используется = Истина;
	УстановитьСвойстваЭлементаЗначенияПараметра();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.Параметры.ТекущиеДанные.Значение = Неопределено;
	УстановитьСвойстваЭлементаЗначенияПараметра();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьТекстЗапроса(Команда)
	ПараметрыФормы = ПодготовитьПараметрыОткрытияТекстаЗапроса();
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.ТекстЗапроса", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстЗапросаПредставления(Команда)
	ПараметрыЗапроса = ПодготовитьПараметрыОткрытияТекстаЗапроса();
	Закрыть(ПараметрыЗапроса.ТекстЗапросаПредставления);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоИспользуемые(Команда)

	ОтображатьТолькоИспользуемыеПоляИПараметры = Не ОтображатьТолькоИспользуемыеПоляИПараметры;

	Элементы.ПоляТолькоИспользуемые.Пометка = ОтображатьТолькоИспользуемыеПоляИПараметры;
	Элементы.ПараметрыТолькоИспользуемые.Пометка = ОтображатьТолькоИспользуемыеПоляИПараметры;

	ИмяПоля = "Используется";
	Если ОтображатьТолькоИспользуемыеПоляИПараметры Тогда
		УстановитьОтборСтрок(Элементы.Поля, ИмяПоля, Истина);
		УстановитьОтборСтрок(Элементы.Параметры, ИмяПоля, Истина);
	Иначе
		УдалитьОтборСтрок(Элементы.Поля, ИмяПоля);
		УдалитьОтборСтрок(Элементы.Параметры, ИмяПоля);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиПараметров(Команда)
	УстановитьСнятьФлажки(ПараметрыПредставлений.НайтиСтроки(Новый Структура(Элементы.Параметры.ОтборСтрок)), Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиПараметров(Команда)
	УстановитьСнятьФлажки(ПараметрыПредставлений.НайтиСтроки(Новый Структура(Элементы.Параметры.ОтборСтрок)), Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиПолей(Команда)
	УстановитьСнятьФлажки(ПоляПредставлений.НайтиСтроки(Новый Структура(Элементы.Поля.ОтборСтрок)), Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиПолей(Команда)
	УстановитьСнятьФлажки(ПоляПредставлений.НайтиСтроки(Новый Структура(Элементы.Поля.ОтборСтрок)), Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СброситьТекущиеНастройки(Команда)
	ИнициализироватьОписанияПредставлений();
	//@skip-check invocation-form-event-handler
	ПредставленияПриАктивизацииСтроки(Элементы.Представления);
КонецПроцедуры

&НаКлиенте
Процедура СброситьКэшОписанийПредставлений(Команда)
	СброситьКэшОписанийПредставленийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПроекта(Команда)
	ПерейтиПоНавигационнойСсылке("https://github.com/iljyxa/SharedQueryDesignerHRM");
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПредставленияИзТекстаЗапроса(Команда)
	
	// Асинх не используется для совместимости с УИ
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводТекстаЗапросаЗавершение" , ЭтотОбъект);
	ТекстПодсказки = "Вставьте текст запроса представления";
	ПоказатьВводСтроки(ОписаниеОповещения, "", ТекстПодсказки, , Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьОписанияПредставленийВХранилище(ОписанияПредставлений)
	Обработка = ОбработкаОбъект();
	
	СохраняемоеЗначение = Новый Структура;
	СохраняемоеЗначение.Вставить("ВерсияКонфигурации", Метаданные.Версия);
	СохраняемоеЗначение.Вставить("ВерсияОбработки", ОбработкаОбъект().Метаданные().Комментарий);
	СохраняемоеЗначение.Вставить("ОписанияПредставлений", ОписанияПредставлений);
	
	Обработка.МодульОбщегоНазначения().ХранилищеОбщихНастроекСохранить(КлючХранилищаНастроек(),
																	   "ОписанияПредставлений",
																	   СохраняемоеЗначение);
КонецПроцедуры

&НаСервере
Функция ОписанияПредставленийИзХранилища()

	Обработка = ОбработкаОбъект();
	МодульОбщегоНазначения = Обработка.МодульОбщегоНазначения();
	СохраненноеЗначение = МодульОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючХранилищаНастроек(),
																				 "ОписанияПредставлений");
	
	ОписанияПредставлений = Неопределено;
	
	Если ТипЗнч(СохраненноеЗначение) = Тип("Структура")
		И СохраненноеЗначение.Свойство("ВерсияКонфигурации")
		И СохраненноеЗначение.Свойство("ВерсияОбработки")
		И СохраненноеЗначение.ВерсияКонфигурации = Метаданные.Версия
		И СохраненноеЗначение.ВерсияОбработки = ОбработкаОбъект().Метаданные().Комментарий Тогда
		
		ОписанияПредставлений = СохраненноеЗначение.ОписанияПредставлений;
	КонецЕсли;
	
	Возврат ОписанияПредставлений;

КонецФункции

&НаСервереБезКонтекста
Функция КлючХранилищаНастроек()
	Возврат "КонструкторПредставленийЗарплатаКадры";
КонецФункции

// Объект текущей обработки
// 
// Возвращаемое значение:
//  ВнешняяОбработка.КонструкторПредставленийЗарплатаКадры - Обработка объект
//
&НаСервере
Функция ОбработкаОбъект()
	
	Если ОбработкаОбъект = Неопределено Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ВводТекстаЗапросаЗавершение(ТекстЗапроса, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		РезультатПомещения = ТекстЗапросаПредставленияВДанныеФормы(ТекстЗапроса);
		Если Не РезультатПомещения.Успех Тогда
			ТекстПредупреждения = СтрШаблон("Не удалось разобрать текст запроса: %1", РезультатПомещения.ТекстОшибки);
			ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Иначе
			Если Элементы.Представления.ТекущаяСтрока = РезультатПомещения.ИдентификаторСтрокиПредставления Тогда
				ПредставленияПослеАктивизацииСтроки();	
			КонецЕсли;
			
			Элементы.Представления.ТекущаяСтрока = РезультатПомещения.ИдентификаторСтрокиПредставления;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСФормой

&НаКлиенте
Процедура УстановитьПодсказкуЗаполненияПолей()

	Представление = Элементы.Представления.ТекущиеДанные;

	Если Представление = Неопределено Тогда
		Элементы.ГруппаПодсказкаПолей.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПодсказкаПолей.Видимость = Представление.ЕстьИсточникДанных
												  И ПустаяСтрока(Представление.ИсточникДанных);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваЭлементаЗначенияПараметра()

	ТекущиеДанные = Элементы.Параметры.ТекущиеДанные;
	Элемент = Элементы.ПараметрыЗначение;

	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ЗначениеЭтоВыражение Тогда
			Элемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		ИначеЕсли ТекущиеДанные.ДоступныеТипы.Типы().Количество() = 0 Тогда
			Элемент.ОграничениеТипа = ОписаниеТипаВсеТипыПараметраПредставления;
		Иначе
			Элемент.ОграничениеТипа = ТекущиеДанные.ДоступныеТипы;
		КонецЕсли;

		Элемент.ВыбиратьТип = ТекущиеДанные.Значение = Неопределено;
		Элемент.КнопкаВыбора = Элемент.ВыбиратьТип И Элемент.ОграничениеТипа.Типы().Количество() > 1;
	Иначе
		Элемент.ОграничениеТипа = Новый ОписаниеТипов;
		Элемент.ВыбиратьТип = Истина;
		Элемент.КнопкаВыбора = Элемент.ВыбиратьТип;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРежимВставки(Форма)

	Форма.Параметры.РежимВставки = Истина;
	Форма.Элементы.ФормаВставитьТекстЗапросаПредставления.Видимость = Истина;
	Форма.Элементы.ФормаВставитьТекстЗапросаПредставления.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРежимИзменения(Форма, ИдентификаторСтрокиПредставления = Неопределено)
	
	Форма.Параметры.РежимИзменения = Истина;
	Форма.Элементы.ФормаВставитьТекстЗапросаПредставления.Видимость = Истина;
	Форма.Элементы.ФормаВставитьТекстЗапросаПредставления.Заголовок = "Изменить";
	Форма.Элементы.ФормаВставитьТекстЗапросаПредставления.КнопкаПоУмолчанию = Истина;
	
	Если ИдентификаторСтрокиПредставления <> Неопределено Тогда
		ДанныеСтроки = Форма.Представления.НайтиПоИдентификатору(ИдентификаторСтрокиПредставления);
		Форма.Заголовок = ДанныеСтроки.Имя + ": " + Форма.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрок(ЭлементФормыТаблица, ИмяПоля, Значение)

	Если ТипЗнч(ЭлементФормыТаблица.ОтборСтрок) = Тип("ФиксированнаяСтруктура") Тогда
		ОтборСтрок = Новый Структура(ЭлементФормыТаблица.ОтборСтрок);
	Иначе
		ОтборСтрок = Новый Структура;
	КонецЕсли;

	ОтборСтрок.Вставить(ИмяПоля, Значение);

	ЭлементФормыТаблица.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок); // Вызов сервера

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьОтборСтрок(ЭлементФормыТаблица, ИмяПоля)

	Если ЭлементФормыТаблица.ОтборСтрок = Неопределено Или Не ЭлементФормыТаблица.ОтборСтрок.Свойство(ИмяПоля) Тогда

		Возврат;
	КонецЕсли;

	ОтборСтрок = Новый Структура(ЭлементФормыТаблица.ОтборСтрок);
	ОтборСтрок.Удалить(ИмяПоля);
	ЭлементФормыТаблица.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСнятьФлажки(Таблица, Установить)

	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.Используется = Установить;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СброситьКэшОписанийПредставленийНаСервере()
	ИнициализироватьОписанияПредставлений(Ложь);
КонецПроцедуры

// Производит заполнение всех доступных представлений с предварительной очисткой текущего состояния.
// Помещает описания представлений в кэш, в качестве которого использует хранилище настроек, с целью
// уменьшения времени повторного открытия формы.
//
// Параметры:
//   ЗаполнитьИзКэша - Булево - признак получения описания представлений из кэша.
//								Если описания не кэшировались ранее, то  

&НаСервере
Процедура ИнициализироватьОписанияПредставлений(Знач ЗаполнитьИзКэша = Истина)
	
	ИмяТекущегоПредставления = Неопределено;
	ТекущаяСтрока = Элементы.Представления.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ИмяТекущегоПредставления = Представления.НайтиПоИдентификатору(ТекущаяСтрока).Имя;
	КонецЕсли;
	
	Представления.Очистить();
	ПоляПредставлений.Очистить();
	ПараметрыПредставлений.Очистить();
	
	Если ЗаполнитьИзКэша Тогда
		ОписанияПредставлений = ОписанияПредставленийИзХранилища();
	КонецЕсли;
	
	Обработка = ОбработкаОбъект();
	
	Если ОписанияПредставлений = Неопределено Тогда
		ОписанияПредставлений = Обработка.ОписанияПредставленийПоКонфигурации();
		СохранитьОписанияПредставленийВХранилище(ОписанияПредставлений);
	КонецЕсли;
	
	Для Каждого КлючИзначение Из ОписанияПредставлений Цикл
		Описание = КлючИзначение.Значение;

		ИдентификаторПредставления = Новый УникальныйИдентификатор;

		Представление = Представления.Добавить();
		ЗаполнитьЗначенияСвойств(Представление, Описание);
		Представление.ИдентификаторПредставления = ИдентификаторПредставления;
		
		Описание.ДоступныеПараметры.Сортировать("Обязательный УБЫВ, Имя");

		Для Каждого ДоступныйПараметр Из Описание.ДоступныеПараметры Цикл
			Параметр = ПараметрыПредставлений.Добавить();
			ЗаполнитьЗначенияСвойств(Параметр, ДоступныйПараметр);
			Параметр.ИдентификаторПредставления = ИдентификаторПредставления;
			Параметр.Используется = ДоступныйПараметр.Обязательный;
			Параметр.СписокВыбора = ДоступныйПараметр.ДоступныеЗначения;
			Параметр.ДоступныеТипы = ДоступныйПараметр.Тип;
		КонецЦикла;

		Для Каждого ДоступноеПоле Из Описание.ДоступныеПоля Цикл
			Поле = ПоляПредставлений.Добавить();
			ЗаполнитьЗначенияСвойств(Поле, ДоступноеПоле);
			Поле.ИдентификаторПредставления = ИдентификаторПредставления;
		КонецЦикла;
		
		Представление.ШаблонПрограммногоИнтерфейса = Описание.ПрограммныйИнтерфейс.Шаблон;

		Для Каждого ПараметрПрограммногоИнтерфейса Из Описание.ПрограммныйИнтерфейс.Параметры Цикл
			Параметр = Представление.ПараметрыПрограммногоИнтерфейса.Добавить();
			ЗаполнитьЗначенияСвойств(Параметр, ПараметрПрограммногоИнтерфейса);
		КонецЦикла;
		
	КонецЦикла;

	Представления.Сортировать("Имя");
	
	НайденныеСтроки = Представления.НайтиСтроки(Новый Структура("Имя", ИмяТекущегоПредставления));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.Представления.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список выбора источника данных периодическими регистрами.
// Регистры с префиксом "Удалить" игнорируются.
//
&НаСервере
Процедура ЗаполнитьСписокВыбораИсточникаДанных()

	СписокВыбора = Элементы.ПредставленияИсточникДанных.СписокВыбора;
	СписокВыбора.Очистить();
	КартинкаРегистрСведений = БиблиотекаКартинок.РегистрСведений;

	Для Каждого РегистрСведений Из Метаданные.РегистрыСведений Цикл
		Если РегистрСведений.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
			 Или СтрНачинаетсяС(РегистрСведений.Имя, "Удалить") Тогда

			Продолжить;
		КонецЕсли;

		ЭлементСписка = СписокВыбора.Добавить();
		ЭлементСписка.Значение = РегистрСведений.Имя;
		ЭлементСписка.Представление = СтрШаблон("%1 (%2)", РегистрСведений.Представление(), РегистрСведений.Имя);
		ЭлементСписка.Картинка = КартинкаРегистрСведений;
	КонецЦикла;

	СписокВыбора.СортироватьПоПредставлению();

КонецПроцедуры

// Обрабатывает изменение источника данных представления на сервере.
// Заполняет доступные поля представления для текущего представления и источника данных.
//
&НаСервере
Процедура ПредставленияИсточникДанныхПриИзмененииНаСервере()

	Представление = Представления.НайтиПоИдентификатору(Элементы.Представления.ТекущаяСтрока);

	ПоляПредставления = ПоляПредставлений.НайтиСтроки(Новый Структура("ИдентификаторПредставления",
																	  Представление.ИдентификаторПредставления));

	Для Каждого Поле Из ПоляПредставления Цикл
		ПоляПредставлений.Удалить(Поле);
	КонецЦикла;

	ОбработкаОбъект = ОбработкаОбъект();

	Если ВРег(Представление.Имя) = ВРег("ТаблицаРегистра")
		 Или ВРег(Представление.Имя) = ВРег("СрезПоследних")
		 Или ВРег(Представление.Имя) = ВРег("СрезПервых") Тогда

		МодульОбщегоНазначения = ОбработкаОбъект.МодульОбщегоНазначения();
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		МодульЗарплатаКадрыОбщиеНаборыДанных = МодульОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбщиеНаборыДанных");

		ИмяВТФильтра = "ВТФильтр";
		ОписаниеФильтра = МодульЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяВТФильтра,
																									  "Период");

		Если ВРег(Представление.Имя) = ВРег("ТаблицаРегистра") Тогда
			Запрос = МодульЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистра(Представление.ИсточникДанных,
																			  Истина,
																			  ОписаниеФильтра);
		ИначеЕсли ВРег(Представление.Имя) = ВРег("СрезПоследних") Тогда
			Запрос = МодульЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(Представление.ИсточникДанных,
																				  Истина,
																				  ОписаниеФильтра,
																				  ,
																				  Истина);
		Иначе
			Запрос = МодульЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(Представление.ИсточникДанных,
																				  Истина,
																				  ОписаниеФильтра,
																				  ,
																				  Ложь);
		КонецЕсли;

		ОписаниеПредставления = ОбработкаОбъект.НовоеОписаниеПредставления();
		ОбработкаОбъект.ПоляЗапросаВДоступныеПоляПредставления(Запрос.Текст, ОписаниеПредставления);

		Для Каждого ДоступноеПоле Из ОписаниеПредставления.ДоступныеПоля Цикл
			Поле = ПоляПредставлений.Добавить();
			ЗаполнитьЗначенияСвойств(Поле, ДоступноеПоле);
			Поле.ИдентификаторПредставления = Представление.ИдентификаторПредставления;
		КонецЦикла;
	КонецЕсли;

	ДоступныеЛевыеЗначенияОтбора.ЗагрузитьЗначения(ДоступныеЛевыеЗначенияОтбораПредставления(Представление.ИдентификаторПредставления));

КонецПроцедуры

// Подготавливает параметры открытия формы текста запроса для текущего представления.
//
// Возвращаемое значение:
//   Структура:
//     * ТекстЗапросаПредставления - Строка - текст запроса выбранного представления
//     * КодПрограммногоИнтерфейса - Строка - сформированный код программного интерфейса представления
&НаСервере
Функция ПодготовитьПараметрыОткрытияТекстаЗапроса()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТекстЗапросаПредставления", "");
	ПараметрыОткрытия.Вставить("КодПрограммногоИнтерфейса", "");
	
	ТекущаяСтрокаПредставления = Элементы.Представления.ТекущаяСтрока;
	Если ТекущаяСтрокаПредставления = Неопределено Тогда
		Возврат ПараметрыОткрытия;
	КонецЕсли;
	
	Представление = Представления.НайтиПоИдентификатору(ТекущаяСтрокаПредставления);
	ПараметрыОтбора = Новый Структура("Используется,ИдентификаторПредставления",
									  Истина,
									  Представление.ИдентификаторПредставления);
	ВыбранныеПоля = ПоляПредставлений.НайтиСтроки(ПараметрыОтбора);
	ВыбранныеПараметры = ПараметрыПредставлений.НайтиСтроки(ПараметрыОтбора);
	
	Обработка = ОбработкаОбъект();
	
	ПараметрыОткрытия.ТекстЗапросаПредставления = Обработка.СформироватьТекстЗапросаПредставления(Представление, ВыбранныеПоля, ВыбранныеПараметры);
	
	Если Представление.ЕстьПрограммныйИнтерфейс Тогда
		
		ВыбранныеПоляМассив = Обработка.МодульОбщегоНазначения().ВыгрузитьКолонку(ВыбранныеПоля, "Имя");
		
		ВидыПараметровПрограммногоИнтерфейса = Обработка.ВидыПараметровПрограммногоИнтерфейса();
		
		ПараметрыПрограммногоИнтерфейса = Представление.ПараметрыПрограммногоИнтерфейса.Выгрузить();
		ПараметрыПрограммногоИнтерфейса.Колонки.Добавить("Значение");
		
		Для Каждого ПараметрПрограммногоИнтерфейса Из ПараметрыПрограммногоИнтерфейса Цикл
			
			Если ПараметрПрограммногоИнтерфейса.Вид = ВидыПараметровПрограммногоИнтерфейса.ИменаПолей Тогда
				
				ПараметрПрограммногоИнтерфейса.Значение = ВыбранныеПоляМассив;
				
			ИначеЕсли ПараметрПрограммногоИнтерфейса.Вид = ВидыПараметровПрограммногоИнтерфейса.Фильтр Тогда
				
				ПараметрПрограммногоИнтерфейса.Значение = """" + Представление.Фильтр + """";
				
			ИначеЕсли ПараметрПрограммногоИнтерфейса.Вид = ВидыПараметровПрограммногоИнтерфейса.ИсточникДанных Тогда
				
				ПараметрПрограммногоИнтерфейса.Значение = """" + Представление.ИсточникДанных + """";
				
			ИначеЕсли ПараметрПрограммногоИнтерфейса.Вид = ВидыПараметровПрограммногоИнтерфейса.Отборы Тогда
				
				Отборы = Новый Массив;
				
				Для Каждого ВыбранныйПараметр Из ВыбранныеПараметры Цикл
					
					Если ВыбранныйПараметр.Отбор Тогда
						Значение = ?(ВыбранныйПараметр.ЗначениеЭтоВыражение,
									 ВыбранныйПараметр.Значение,
									 Обработка.ЗначениеПараметраВВыражениеЯзыкаЗапроса(ВыбранныйПараметр.Значение));
						
						Отборы.Добавить(СтрШаблон(
							"ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, %1, %2, %3);",
							ВыбранныйПараметр.Имя,
							Обработка.ЗначениеПараметраВВыражениеЯзыкаЗапроса(ВыбранныйПараметр.ВидСравнения),
							Значение)
						);
					КонецЕсли;
					
				КонецЦикла;
				
				ПараметрПрограммногоИнтерфейса.Значение = СтрСоединить(Отборы, Символы.ПС);
			
			ИначеЕсли ПараметрПрограммногоИнтерфейса.Вид = ВидыПараметровПрограммногоИнтерфейса.ПсевдонимыПолейСКД Тогда
				
				ПсевдонимыПолейСКД = Новый Массив;
				
				ВыбранныйДоступныйПараметр = НайтиПоИмени(ВыбранныеПараметры, ПараметрПрограммногоИнтерфейса.ДоступныйПараметр);
				Если ВыбранныйДоступныйПараметр <> Неопределено Тогда
					
					МассивОпределений = СтрРазделить(ВыбранныйДоступныйПараметр.Значение, ",");
					
					Для Каждого СтрокаОпределения Из МассивОпределений Цикл
						Позиция = СтрНайти(СтрокаОпределения, " КАК ");
						Если Позиция > 0 Тогда
							ПсевдонимыПолейСКД.Добавить(СтрШаблон(
								"ПараметрыПостроения.СоответствиеПсевдонимовПолейСКД.Вставить(""%1"", ""%2"")",
								СокрЛП(Лев(СтрокаОпределения, Позиция - 1)),
								СокрЛП(Сред(СтрокаОпределения, Позиция + 5)))
							);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
				ПараметрПрограммногоИнтерфейса.Значение = СтрСоединить(ПсевдонимыПолейСКД, Символы.ПС);
				
			ИначеЕсли ЗначениеЗаполнено(ПараметрПрограммногоИнтерфейса.ДоступныйПараметр) Тогда
				
				ВыбранныйДоступныйПараметр = НайтиПоИмени(ВыбранныеПараметры, ПараметрПрограммногоИнтерфейса.ДоступныйПараметр);
				Если ВыбранныйДоступныйПараметр <> Неопределено Тогда
					ПараметрПрограммногоИнтерфейса.Значение = ВыбранныйДоступныйПараметр.Значение;
				ИначеЕсли ПараметрПрограммногоИнтерфейса.Обязательный Тогда
					ПараметрПрограммногоИнтерфейса.Значение = "<" + ПараметрПрограммногоИнтерфейса.Имя + ">";
				Иначе
					ПараметрПрограммногоИнтерфейса.Значение = "";
				КонецЕсли;
				
			Иначе
				// Обработка не требуется
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыОткрытия.КодПрограммногоИнтерфейса = Обработка.КодПрограммногоИнтерфейса(Представление.ШаблонПрограммногоИнтерфейса,
																						  ПараметрыПрограммногоИнтерфейса); 
	КонецЕсли;
	
	Возврат ПараметрыОткрытия;
		
КонецФункции

// Возвращает доступные левые значения отбора для указанного представления.
//
// Параметры:
//   ИдентификаторПредставления - Число - Идентификатор представления, для которого необходимо 
//   									  получить доступные левые значения отбора
//
// Возвращаемое значение:
//   Массив Из Строка - Массив доступных левых значений отбора для указанного представления
&НаСервере
Функция ДоступныеЛевыеЗначенияОтбораПредставления(Знач ИдентификаторПредставления)

	ПараметрыОтбора = Новый Структура("ИдентификаторПредставления", ИдентификаторПредставления);

	Возврат ПоляПредставлений.Выгрузить(ПараметрыОтбора).ВыгрузитьКолонку("Имя");

КонецФункции

// Разбирает текст запроса представления и помещает в данные формы.
// Если представление с таким именем уже существует, то дополняет его.
// Иначе добавляет новое.
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
// 
// Возвращаемое значение:
//  Структура - Текст запроса представления в данные формы:
// * Успех - Булево - Признак успешного разбора представления и помещения в данные формы
// * ТекстОшибки - Строка - Если Успех = Ложь, то содержит текст ошибки
// * ИдентификаторСтрокиПредставления - Неопределено, Число - Если Успех = Истина, то содержит идентификатор
//															  строки таблицы формы Представления, в которору было
//															  помещено представление.
// * ИдентификаторПредставления - Неопределено, УникальныйИдентификатор - Если Успех = Истина, то содержит идентификатор
//															  			  представления.
&НаСервере
Функция ТекстЗапросаПредставленияВДанныеФормы(Знач ТекстЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ИдентификаторСтрокиПредставления", Неопределено);
	Результат.Вставить("ИдентификаторПредставления", Неопределено);
	
	РезультатРазбора = ОбработкаОбъект().РазобратьТекстЗапросаПредставления(ТекстЗапроса);
	
	Если Не РезультатРазбора.Успех Тогда
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = РезультатРазбора.ТекстОшибки;
		Возврат Результат;	
	КонецЕсли;
	
	Представление = НайтиПоИмени(Представления, РезультатРазбора.Имя);
	Если Представление = Неопределено Тогда
		Представление = Представления.Добавить();
		Представление.ИдентификаторПредставления = Новый УникальныйИдентификатор;
		Представление.Имя = РезультатРазбора.Имя;
	КонецЕсли;
	
	Представление.ИсточникДанных = РезультатРазбора.ИсточникДанных;
	Представление.Уточнение = РезультатРазбора.Уточнение;
	Представление.Фильтр = РезультатРазбора.Фильтр;
	Представление.ЕстьИсточникДанных = Не ПустаяСтрока(Представление.ИсточникДанных);
	Представление.ЕстьФильтр = Не ПустаяСтрока(Представление.Фильтр);
	
	Результат.ИдентификаторСтрокиПредставления = Представление.ПолучитьИдентификатор();
	Результат.ИдентификаторПредставления = Представление.ИдентификаторПредставления;
	
	ПараметрыОтбора = Новый Структура("ИдентификаторПредставления", Представление.ИдентификаторПредставления);
	ПоляТекущегоПредставления = ПоляПредставлений.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ПолеПредставления Из ПоляТекущегоПредставления Цикл
		ПолеПредставления.Используется = Ложь;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из РезультатРазбора.Поля Цикл
		ИмяПоля = КлючИЗначение.Ключ;
		ВыражениеПоля = КлючИЗначение.Значение;

		ПолеПредставления = НайтиПоИмени(ПоляТекущегоПредставления, ИмяПоля);
		Если ПолеПредставления = Неопределено Тогда
			ПолеПредставления = ПоляПредставлений.Добавить();
			ПолеПредставления.ИдентификаторПредставления = Представление.ИдентификаторПредставления;
			ПолеПредставления.Имя = ИмяПоля;
		КонецЕсли;

		ПолеПредставления.Используется = Истина;
		ПолеПредставления.Выражение = ВыражениеПоля;
	КонецЦикла;
	
	ПараметрыТекущегоПредставления = ПараметрыПредставлений.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ПараметрПредставления Из ПараметрыТекущегоПредставления Цикл
		ПараметрПредставления.Используется = Ложь;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из РезультатРазбора.Параметры Цикл
		ИмяПараметра = КлючИЗначение.Ключ;
		ЗначениеПараметра = КлючИЗначение.Значение;

		ПараметрПредставления = НайтиПоИмени(ПараметрыТекущегоПредставления, ИмяПараметра);
		Если ПараметрПредставления = Неопределено Тогда
			ПараметрПредставления = ПараметрыПредставлений.Добавить();
			ПараметрПредставления.ИдентификаторПредставления = Представление.ИдентификаторПредставления;
			ПараметрПредставления.Имя = ИмяПараметра;
		КонецЕсли;

		ПараметрПредставления.Используется = Истина;
		ПараметрПредставления.Значение = ЗначениеПараметра;
		// Базовая проверка. Функция ПараметрыЗапроса удаляет кавычки. При необходимости разработать
		// аналогичную функцию.
		ПараметрПредставления.ЗначениеЭтоВыражение = СтрНайти(ЗначениеПараметра, "&") > 0;
	КонецЦикла;

	ДоступныеВидыСравненияОтбора = ОбработкаОбъект().ДоступныеВидыСравненияОтбора();
	СоответствиеВидовСравнения = Новый Соответствие;
	Для Каждого КлючИЗначение Из ДоступныеВидыСравненияОтбора Цикл
		СоответствиеВидовСравнения.Вставить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;

	Для Каждого ОписаниеОтбора Из РезультатРазбора.Отборы Цикл
		ПараметрПредставления = НайтиПоИмени(ПараметрыТекущегоПредставления, ОписаниеОтбора.ЛевоеЗначение);
		Если ПараметрПредставления = Неопределено Тогда
			ПараметрПредставления = ПараметрыПредставлений.Добавить();
			ПараметрПредставления.ИдентификаторПредставления = Представление.ИдентификаторПредставления;
			ПараметрПредставления.Имя = ОписаниеОтбора.ЛевоеЗначение;	
		КонецЕсли;
		
		ПараметрПредставления.Используется = Истина;
		ПараметрПредставления.Отбор = Истина;
		ПараметрПредставления.ВидСравнения = СоответствиеВидовСравнения[ОписаниеОтбора.ВидСравнения];
		ПараметрПредставления.Значение = ОписаниеОтбора.ПравоеЗначение;
		// Базовая проверка. Функция КоллекцияОтборПоПараметрам удаляет кавычки. При необходимости разработать
		// аналогичную функцию.
		ПараметрПредставления.ЗначениеЭтоВыражение = СтрНайти(ОписаниеОтбора.ПравоеЗначение, "&") > 0;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выполняет регистронезависимый поиск по полю Имя в коллекции.
// Добавление отдельного поля для поиска не имеет смысла т.к. коллекции очень маленькие.
// 
// Параметры:
//  Коллекция - ДанныеФормыКоллекция, Массив из ДанныеФормыЭлементКоллекции - Коллекция
//  Значение - Строка - Значение
// 
// Возвращаемое значение:
//  Неопределено, ДанныеФормыЭлементКоллекции - Найти по имени
&НаСервереБезКонтекста
Функция НайтиПоИмени(Коллекция, Значение)

	ЗначениеВРег = ВРег(Значение);

	НайденнаяСтрока = Неопределено;

	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		Если ВРег(СтрокаКоллекции.Имя) = ЗначениеВРег Тогда
			НайденнаяСтрока = СтрокаКоллекции;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат НайденнаяСтрока;

КонецФункции

#КонецОбласти

#Область ПакетныйРежим

// Параметры запуска.
// 
// Возвращаемое значение:
//  См. РазобратьПараметрыЗапуска
//
&НаСервереБезКонтекста
Функция ПараметрыЗапуска()
		
	ПараметрЗапуска = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере(Ложь).Получить("ПараметрЗапуска");
	
	Возврат РазобратьПараметрыЗапуска(ПараметрЗапуска);
		
КонецФункции

// Разобрать параметры запуска.
// 
// Параметры:
//  СтрокаЗапуска - Строка - Строка запуска
// 
// Возвращаемое значение:
//  Структура:
//   * ПакетныйРежим - Булево - Пакетный режим
//   * КаталогВыгрузки - Строка - Каталог выгрузки
//  
&НаСервереБезКонтекста
Функция РазобратьПараметрыЗапуска(Знач СтрокаЗапуска)
	
	// Ожидаемый формат:
	// mode=batch;out=C:\temp\result.json
	
	Результат = Новый Структура;
	Результат.Вставить("ПакетныйРежим", Ложь);
	Результат.Вставить("КаталогВыгрузки", "");
	
	Если СтрНайти(СтрокаЗапуска, "=") = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	//@skip-check empty-except-statement
	Попытка
		//@skip-check bsl-nstr-string-literal-format
		Результат.ПакетныйРежим = НСтр(СтрокаЗапуска, "mode") = "batch";
		//@skip-check bsl-nstr-string-literal-format
		Результат.КаталогВыгрузки = НСтр(СтрокаЗапуска, "out");
	Исключение
		// Обработка не требуется
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти