// Copyright (c) 2025 Ilya Fedorov
// SPDX-License-Identifier: MIT
// https://github.com/iljyxa/SharedQueryDesignerHRM
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Модуль общего назначения.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Модуль общего назначения
Функция МодульОбщегоНазначения() Экспорт
	Возврат ОбщегоНазначения;
КонецФункции

// Модуль общего назначения клиент сервер.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Модуль общего назначения клиент сервер
Функция МодульОбщегоНазначенияКлиентСервер() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер;
КонецФункции

// Описания представлений по конфигурации.
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Описания представлений:
//	 * Ключ - Строка - Имя представления
//	 * Значение - См. НовоеОписаниеПредставления
Функция ОписанияПредставленийПоКонфигурации() Экспорт

	ОписанияПредставлений = Новый Соответствие;

	ДобавитьОписанияПредставлений_Базовые(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_АттестацииСотрудников(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_КадровоеПланирование(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_КадровыйУчет(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_КадровыйРезервГосслужащих(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_Медицина(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_ОхранаТруда(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_ОстаткиОтпусков(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_ОтражениеЗарплатыВБухучете(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_ПодборПерсонала(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_УправлениеШтатнымРасписанием(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_УчетБюджетныхУчреждений(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_УчетНачисленнойЗарплаты(ОписанияПредставлений);
	ДобавитьОписанияПредставлений_УчетРабочегоВремени(ОписанияПредставлений);

	Возврат ОписанияПредставлений;

КонецФункции

// Удаляет из текста запроса символы переноса строк и кавычки
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаИзСтрокКода(Знач ТекстЗапроса) Экспорт
	
	ТекстЗапроса = СокрЛП(ТекстЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """""", """");
	
	Если СтрНачинаетсяС(ТекстЗапроса, """") Тогда
		ТекстЗапроса = Сред(ТекстЗапроса, 2);
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(ТекстЗапроса, """") Тогда
		ТекстЗапроса = Сред(ТекстЗапроса, 1, СтрДлина(ТекстЗапроса) - 1);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "|", "");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст на языке запросов из описания представления
//
// Параметры:
//   Свойства - Структура - Параметры представления:
//    * Имя			   - Строка - Имя
//    * Уточнение	   - Строка - Уточнение (постфикс/разделитель) имени
//    * ИсточникДанных - Строка - Источник данных
//    * Фильтр		   - Строка - Фильтр
//   Поля - ТаблицаЗначений, Массив Из Структура - Коллекция полей:
//    * Имя - Строка - Имя
//    * Выражение - Строка - Выражение
//   Параметры - ТаблицаЗначений, Массив Из Структура - Параметры:
//    * Имя - Строка - Имя
//    * Отбор - Булево - Признак отбора
//    * Значение - Произвольный - Значение
//    * ВидСравнения - ВидСравненияКомпоновкиДанных - Вид сравнения
//    * ЗначениеЭтоВыражение - Булево - Признак того, что значение является выражением
//
// Возвращаемое значение:
//   Строка - Сформированный текст запроса для представления
Функция СформироватьТекстЗапросаПредставления(Свойства,
											  Поля,
											  Параметры) Экспорт
	
	ШаблонЗапроса = "ВЫБРАТЬ
					|	%1
					|ПОМЕСТИТЬ Представления_%2%3%4
					|%5
					|%6";

	ПоляЗапроса = Новый Массив;
	ШаблонПоля = "%1 КАК %2";
	Для Каждого ВыбранноеПоле Из Поля Цикл
		ПоляЗапроса.Добавить(СтрШаблон(ШаблонПоля, ВыбранноеПоле.Выражение, ВыбранноеПоле.Имя));
	КонецЦикла;
	
	ИсточникДанных = ?(Не ПустаяСтрока(Свойства.ИсточникДанных),
					   "_" + Свойства.ИсточникДанных,
					   "");
					   
	Уточнение = ?(Не ПустаяСтрока(Свойства.Уточнение),
				  "_" + Свойства.Уточнение,
				  "");
	
	ТекстИз = "";
	Если Не ПустаяСтрока(Свойства.Фильтр) Тогда
		ТекстИз = "ИЗ
				  |	" + Свойства.Фильтр + " КАК " + Свойства.Фильтр;
	КонецЕсли;

	ОтборыЗапроса = Новый Массив;
	НомерОтбора = 1;
	Для Каждого ВыбранныйПараметр Из Параметры Цикл
		Если ВыбранныйПараметр.Отбор Тогда
			РазделительПараметров = Формат(НомерОтбора, "ЧГ=;");
			НомерОтбора = НомерОтбора + 1;
		Иначе
			РазделительПараметров = "";
		КонецЕсли;
		ОтборыЗапроса.Добавить(ВыбранныйПараметрВВыражениеЯзыкаЗапроса(ВыбранныйПараметр, РазделительПараметров));
	КонецЦикла;

	ТекстГДЕ = "";
	Если ОтборыЗапроса.Количество() > 0 Тогда
		ТекстГДЕ = "ГДЕ
				   |	" + СтрСоединить(ОтборыЗапроса, Символы.ПС + Символы.Таб + "И ");
	КонецЕсли;
	
	Возврат СтрШаблон(ШаблонЗапроса,
							 СтрСоединить(ПоляЗапроса, "," + Символы.ПС + Символы.Таб),
							 Свойства.Имя,
							 ИсточникДанных,
							 Уточнение,
							 ТекстИз,
							 ТекстГДЕ);

КонецФункции

// Разбирает на составные части текст запроса представления
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
// 
// Возвращаемое значение:
//  Структура - Разобрать текст запроса представления:
// * Успех - Булево - Ложь, если произошла ошибка
// * ТекстОшибки - Строка - Если Успех = Ложь, то содержит текст ошибки
// * Имя - Строка - Имя представления
// * ИсточникДанных - Строка - Источник данных представления
// * Фильтр - Строка - Фильтр представления
// * Уточнение - Строка - Уточнение представления
// * Поля - Структура - Поля представления:
// 	** Ключ - Строка - Имя поля
// 	** Значение - Строка - Выражение поля
// * Параметры - Структура - Параметры представления без отборов:
// 	** Ключ - Строка - Имя параметра
// 	** Значение - Строка - Значение параметра
// * Отборы - Массив Из Структура  - Отборы представления:
//	** ЛевоеЗначение - Строка - Левое значение
//	** ВидСравнения - Строка - Вид сравнения
//	** ПравоеЗначение - Строка - Правое значение
Функция РазобратьТекстЗапросаПредставления(Знач ТекстЗапроса) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Имя", "");
	Результат.Вставить("ИсточникДанных", "");
	Результат.Вставить("Фильтр", "");
	Результат.Вставить("Уточнение", "");
	Результат.Вставить("Поля", Новый Структура);
	Результат.Вставить("Параметры", Новый Структура);
	Результат.Вставить("Отборы", Новый Массив);
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = "Пустой текст запроса";
		
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = СокрЛП(ТекстЗапроса);
	Если СтрНайти(ТекстЗапроса, "|") > 0 Тогда
		ТекстЗапроса = ТекстЗапросаИзСтрокКода(ТекстЗапроса);
	КонецЕсли;
	
	МодульОбщегоНазначения = МодульОбщегоНазначения();
	//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
	МодульЗарплатаКадрыОбщиеНаборыДанных = МодульОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбщиеНаборыДанных");

	КлючевоеСловоПоместить = "ПОМЕСТИТЬ";
	ПозицияСловаПоместить = СтрНайти(ВРег(ТекстЗапроса), КлючевоеСловоПоместить + " ");

	Если ПозицияСловаПоместить = 0 Тогда
		Результат.Успех = Ложь;
		Результат.ТекстОшибки =
			"В тексте запроса не найдено ключевое слово ПОМЕСТИТЬ.
			|Ожидалось полное имя представления вида ПОМЕСТИТЬ Представления_ИмяПредставления.";
		
		Возврат Результат;
	КонецЕсли;
	
	НачальнаяПозиция = ПозицияСловаПоместить + СтрДлина(КлючевоеСловоПоместить + " ");
	ПолноеИмяПредставления = МодульЗарплатаКадрыОбщиеНаборыДанных.ПервоеСловоНачинаяСПозицииВТексте(ТекстЗапроса,
																									НачальнаяПозиция);
	ПолноеИмяПредставления = СокрЛП(ПолноеИмяПредставления);
	ЧастиПолногоИмениПредставления = РазобратьПолноеИмяПредставления(ПолноеИмяПредставления);

	Если ПустаяСтрока(ЧастиПолногоИмениПредставления.Имя) Тогда
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = СтрШаблон(
			"Неверное имя таблицы представления %1. Ожидалось имя вида Представления_ИмяПредставления.",
			ПолноеИмяПредставления);
		
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ЧастиПолногоИмениПредставления);
	
	МассивИменВТИсточниковПараметров = МодульЗарплатаКадрыОбщиеНаборыДанных.МассивИменВТИсточниковПараметров(ТекстЗапроса,
																											 ПолноеИмяПредставления);
	Если МассивИменВТИсточниковПараметров.Количество() > 0 Тогда
		Результат.Фильтр = МассивИменВТИсточниковПараметров[0];
	КонецЕсли;

	Результат.Поля = МодульЗарплатаКадрыОбщиеНаборыДанных.ПоляЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
	Результат.Параметры = МодульЗарплатаКадрыОбщиеНаборыДанных.ПараметрыЗапроса(ТекстЗапроса, ПолноеИмяПредставления);
	Результат.Отборы = МодульЗарплатаКадрыОбщиеНаборыДанных.КоллекцияОтборПоПараметрам(Результат.Параметры);
	
	УдаляемыеПараметры = Новый Массив;
	Для Каждого КлючИЗначение Из Результат.Параметры Цикл
		ИмяПараметра = КлючИЗначение.Ключ;
		Если СтрНачинаетсяС(ВРег(ИмяПараметра), ВРег("ЛевоеЗначение"))
			 Или СтрНачинаетсяС(ВРег(ИмяПараметра), ВРег("ВидСравнения"))
			 Или СтрНачинаетсяС(ВРег(ИмяПараметра), ВРег("ПравоеЗначение")) Тогда

			УдаляемыеПараметры.Добавить(ИмяПараметра);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого ИмяПараметра Из УдаляемыеПараметры Цикл
		Результат.Параметры.Удалить(ИмяПараметра);	
	КонецЦикла;
	
	Если Результат.Отборы = Неопределено Тогда
		Результат.Отборы = Новый Массив;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет в шаблон программного кода значения параметров программного интерфейса представления.
//
// Параметры:
//   Шаблон - Строка - Шаблон программного кода с плейсхолдерами вида <ИмяПараметра>
//   ПараметрыПрограммногоИнтерфейса - Массив из Структура - Описание параметров шаблона:
//     * Вид - см. ВидыПараметровПрограммногоИнтерфейса
//     * Имя - Строка - Имя параметра, соответствующее плейсхолдеру в шаблоне
//     * Обязательный - Булево - Признак обязательности параметра
//     * Значение - Произвольный - Значение параметра
//
// Возвращаемое значение:
//   Строка - Шаблон программного кода с подставленными значениями параметров
Функция КодПрограммногоИнтерфейса(Знач Шаблон, ПараметрыПрограммногоИнтерфейса) Экспорт

	ВидыПараметров = ВидыПараметровПрограммногоИнтерфейса();
		
	Для Каждого Параметр Из ПараметрыПрограммногоИнтерфейса Цикл
		
		Если Параметр.Вид = ВидыПараметров.ИменаПолей Тогда
			
			Если Параметр.Значение.Количество() > 3 Тогда
				ОбъявлениеМассиваПолей = Новый Массив;
				ОбъявлениеМассиваПолей.Добавить(Параметр.Имя + " = Новый Массив;");
				Для Каждого ИмяПоля Из Параметр.Значение Цикл
					ОбъявлениеМассиваПолей.Добавить(Параметр.Имя + ".Добавить(""" + ИмяПоля + """);");
				КонецЦикла;
				
				ОбъявлениеМассиваПолей.Добавить(Символы.ПС);
				
				Шаблон = СтрСоединить(ОбъявлениеМассиваПолей, Символы.ПС) + Шаблон;
				
				ЗначениеПараметра = Параметр.Имя;
			Иначе
				ЗначениеПараметра = """" + СтрСоединить(Параметр.Значение, ",") + """"; 
			КонецЕсли;
			
		Иначе
			ЗначениеПараметра = Параметр.Значение;	
		КонецЕсли;
		
		Если ЗначениеПараметра = Неопределено Тогда
			
			Если Параметр.Обязательный Тогда
				ЗначениеПараметра = "Неопределено";
			Иначе
				ЗначениеПараметра = "";	
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Число") Тогда
			ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧРД=.; ЧН=; ЧГ=;");
		ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Булево") Тогда
			ЗначениеПараметра = ?(ЗначениеПараметра, "Истина", "Ложь");
		Иначе
			ЗначениеПараметра = Строка(ЗначениеПараметра);
		КонецЕсли;
		
		Если ЗначениеПараметра = "" Тогда
			Если Параметр.УдалятьСтрокуСПустымПараметром Тогда
				// (?m) - многострочный режим: ^ и $ соответствуют границам строк.
				// ^.*<Имя>.* - вся строка, содержащая плейсхолдер параметра в шаблоне.
				// \r?\n? - перевод строки (Windows или Unix), который удаляется вместе со строкой.
				Шаблон = СтрЗаменитьПоРегулярномуВыражению(Шаблон, "(?m)^.*<" + Параметр.Имя + ">.*\r?\n?", "");
			Иначе
				// (?m) - многострочный режим: ^ и $ соответствуют границам строк.
				// ^[ \t]* - начало строки с произвольным количеством пробелов или табуляций.
				// <Имя> - плейсхолдер параметра в шаблоне.
				// [ \t]* - произвольное количество пробелов или табуляций после плейсхолдера.
				// \r?\n? - перевод строки (Windows или Unix), который вместе с пустой строкой удаляется.
				Шаблон = СтрЗаменитьПоРегулярномуВыражению(Шаблон, "(?m)^[ \t]*<" + Параметр.Имя + ">[ \t]*\r?\n?", "");
			КонецЕсли;
		Иначе
			Шаблон = СтрЗаменить(Шаблон, "<" + Параметр.Имя + ">", ЗначениеПараметра);
		КонецЕсли;

		
	КонецЦикла;

	Возврат Шаблон;

КонецФункции

// Соответствие ВидСравненияКомпоновкиДанных и строкового значения для текста запроса,
// доступные для представлений
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//	 * Ключ - ВидСравненияКомпоновкиДанных - Вид сравнения
//	 * Значение - Строка - Вид сравнения для запроса
Функция ДоступныеВидыСравненияОтбора() Экспорт

	СоответствиеВидовСравнений = Новый Соответствие;
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Больше, ">");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Меньше, "<");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Равно, "=");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ">=");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ">=");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВИерархии, "В ИЕРАРХИИ");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВСписке, "В");
	СоответствиеВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеРавно, "<>");

	Возврат СоответствиеВидовСравнений;

КонецФункции

// Выгружает набор представлений в файлы JSON, один файл на представление,
// в структуру каталогов <Подсистема>/<Имя>.json
//
// Параметры:
//  ОписанияПредставлений - Соответствие Из КлючИЗначение - коллекция описаний представлений:
//   * Ключ - Строка - имя представления.
//   * Значение - См. НовоеОписаниеПредставления
//  КаталогВыгрузки - Строка - каталог, в который будут выгружены файлы. Будет создан, если не существует.
//
Процедура ВыгрузитьПредставленияВJSON(ОписанияПредставлений, КаталогВыгрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан каталог выгрузки'");
	КонецЕсли;

	Файл = Новый Файл(КаталогВыгрузки);
	Если Не Файл.Существует() Тогда
		СоздатьКаталог(КаталогВыгрузки);
		Файл = Новый Файл(КаталогВыгрузки);
	КонецЕсли;

	Если Не Файл.ЭтоКаталог() Тогда
		ВызватьИсключение НСтр("ru = 'Указанный каталог выгрузки не является каталогом'");
	КонецЕсли;
	
	Если Прав(КаталогВыгрузки, 1) <> "\"
		И Прав(КаталогВыгрузки, 1) <> "/" Тогда
			
		КаталогВыгрузки = КаталогВыгрузки + "\";
	КонецЕсли;

	Для Каждого КлючИЗначение Из ОписанияПредставлений Цикл

		Описание = КлючИЗначение.Значение;
		
		Если ПустаяСтрока(Описание.Подсистема) Тогда
			ПодкаталогПодсистемы = "Общие";
		Иначе
			ПодкаталогПодсистемы = СтрЗаменить(Описание.Подсистема, " ", "_");
		КонецЕсли;
		
		ПутьККаталогу = КаталогВыгрузки + ПодкаталогПодсистемы;
		
		Файл = Новый Файл(ПутьККаталогу);
		
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(ПутьККаталогу);
		КонецЕсли;

		ИтоговаяСтруктура = ПредставлениеДляJSON(Описание);

		ИмяФайла = ПутьККаталогу + "\" + Описание.Имя + ".json";
		
		ЗаписатьСтруктуруВJSONФайл(ИтоговаяСтруктура, ИмяФайла);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает выражение пустого значения на языке запросов для указанной колонки схемы запроса.
// если в колонка составного типа, то тип определяется по первому:
//  Ссылочный - ЗНАЧЕНИЕ(Тип.ПустаяСсылка)
//  Число - ВЫРАЗИТЬ(0 КАК ЧИСЛО()) если указана разрядность иначе 0
//  Булево - ЛОЖЬ
//  Дата - ДАТАВРЕМЯ(1, 1, 1)
//  Все остальные случаи - НЕОПРЕДЕЛЕНО
//
// Параметры:
//   КолонкаСхемыЗапроса - КолонкаСхемыЗапроса - колонка схемы запроса, для которой нужно получить пустое значение
//
// Возвращаемое значение:
//   Строка - выражение пустого значения для указанной колонки схемы запроса
Функция ВыражениеПустогоЗначенияПоКолонкеСхемыЗапроса(КолонкаСхемыЗапроса)
	
	ПустоеЗначение = "НЕОПРЕДЕЛЕНО";

	Если ТипЗнч(КолонкаСхемыЗапроса) <> Тип("КолонкаСхемыЗапроса")
		 Или КолонкаСхемыЗапроса.ТипЗначения.Типы().Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
	КонецЕсли;
	
	Тип = КолонкаСхемыЗапроса.ТипЗначения.Типы()[0]; // Тип

	Если МодульОбщегоНазначения().ЭтоСсылка(Тип) Тогда
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		ПустоеЗначение = СтрШаблон("ЗНАЧЕНИЕ(%1.ПустаяСсылка)", ОбъектМетаданных.ПолноеИмя());
	ИначеЕсли Тип = Тип("Число") Тогда
		Разрядность = КолонкаСхемыЗапроса.ТипЗначения.КвалификаторыЧисла.Разрядность;
		РазрядностьДробнойЧасти = КолонкаСхемыЗапроса.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти;
		Если Разрядность > 0 Или РазрядностьДробнойЧасти > 0 Тогда

			ПустоеЗначение = СтрШаблон("ВЫРАЗИТЬ(0 КАК ЧИСЛО(%1, %2))",
									   Формат(Разрядность, "ЧН=; ЧГ=;"),
									   Формат(РазрядностьДробнойЧасти, "ЧН=; ЧГ=;"));
		Иначе
			ПустоеЗначение = "0";
		КонецЕсли;
	ИначеЕсли Тип = Тип("Строка") Тогда
		Если КолонкаСхемыЗапроса.ТипЗначения.КвалификаторыСтроки.Длина > 0 Тогда
			ПустоеЗначение = СтрШаблон("ВЫРАЗИТЬ("""" КАК СТРОКА(%1))",
									   Формат(КолонкаСхемыЗапроса.ТипЗначения.КвалификаторыСтроки.Длина, "ЧН=; ЧГ=;"));
		Иначе
			ПустоеЗначение = """""";
		КонецЕсли;
	ИначеЕсли Тип = Тип("Булево") Тогда
		ПустоеЗначение = "ЛОЖЬ";
	ИначеЕсли Тип = Тип("Дата") Тогда
		ПустоеЗначение = "ДАТАВРЕМЯ(1, 1, 1)";
	Иначе
		// Обработка не требуется
	КонецЕсли;

	Возврат ПустоеЗначение;
	
КонецФункции

#Область РаботаСОписаниямиПредставлений

// Описание представления
// 
// Возвращаемое значение:
//  Структура - Новый описание представления:
// 	 * Подсистема - Строка - Имя подсистемы.
// 	 * Имя - Строка - Имя представления.
// 	 * Фильтр - Строка - Имя фильтра.
// 	 * ЕстьИсточникДанных - Булево - Признак использования источника данных (регистра).
// 	 * ЕстьФильтр - Булево - Признак возможности указания таблицы фильтра.
// 	 * ФильтрОбязателен - Булево - Признак обязательного фильтра (если ЕстьФильтр = Истина).
// 	 * ДоступныОтборы - Булево - Признак доступности отборов в параметрах.
// 	 * Описание - Строка - Текстовое описание представления, подсказки.
// 	 * ДоступныеПараметры - ТаблицаЗначений - Коллекция доступных параметров:
// 	 	** Имя - Строка - Имя параметра
// 	 	** Тип - ОписаниеТипов - Доступные типы параметра.
// 	 	** Значение - Неопределено, Булево, Строка, Число - Значение, если параметр не используется.
// 	 	** Обязательный - Булево - Признак обязательности параметра.
// 	 	** Описание - Строка - Подробное описание параметра.
// 	 * ДоступныеПоля - ТаблицаЗначений - Коллекция доступных полей:
// 	 	** Имя - Строка - Имя поля.
// 	 	** Выражение - Строка - Выражение пустого значения на языке запросов.
// 	 	** ПолныйПуть - Строка - Полный путь к полю. Для построения иерархии. Не используется в данный момент.
//	 * ЕстьПрограммныйИнтерфейс - Булево - Признак наличия программного интерфейса для доступа к представлению
//	 * ПрограммныйИнтерфейс - Структура - Описание программного интерфейса:
//	 	** Шаблон - Строка - Шаблон кода
//	 	** Параметры - Массив Из См. НовоеОписаниеПараметраПрограммногоИнтерфейса
Функция НовоеОписаниеПредставления() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Подсистема", "");
	Описание.Вставить("Имя", "");
	Описание.Вставить("ЕстьИсточникДанных", Ложь);
	Описание.Вставить("ЕстьФильтр", Ложь);
	Описание.Вставить("Фильтр", "");
	Описание.Вставить("ФильтрОбязателен", Истина);
	Описание.Вставить("ДоступныОтборы", Ложь);
	Описание.Вставить("Описание", "");

	Описание.Вставить("ДоступныеПараметры", Новый ТаблицаЗначений);
	Описание.ДоступныеПараметры.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Описание.ДоступныеПараметры.Колонки.Добавить("Тип", Новый ОписаниеТипов);
	Описание.ДоступныеПараметры.Колонки.Добавить("Значение", ОписаниеТипаВсеТипыПараметраПредставления());
	Описание.ДоступныеПараметры.Колонки.Добавить("Обязательный", Новый ОписаниеТипов("Булево"));
	Описание.ДоступныеПараметры.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Описание.ДоступныеПараметры.Колонки.Добавить("ДоступныеЗначения", Новый ОписаниеТипов("СписокЗначений"));
	Описание.ДоступныеПараметры.Колонки.Добавить("ЗначениеЭтоВыражение", Новый ОписаниеТипов("Булево"));
	
	Описание.Вставить("ДоступныеПоля", Новый ТаблицаЗначений);
	Описание.ДоступныеПоля.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Описание.ДоступныеПоля.Колонки.Добавить("Выражение", Новый ОписаниеТипов("Строка"));
	Описание.ДоступныеПоля.Колонки.Добавить("ПолныйПуть", Новый ОписаниеТипов("Строка"));
	Описание.ДоступныеПоля.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	
	Описание.Вставить("ЕстьПрограммныйИнтерфейс", Ложь);
	Описание.Вставить("ПрограммныйИнтерфейс", Новый Структура);
	Описание.ПрограммныйИнтерфейс.Вставить("Шаблон", "");
	Описание.ПрограммныйИнтерфейс.Вставить("Параметры", Новый Массив);

	Возврат Описание;

КонецФункции

// Добавляет новый параметр к описанию представления
// 
// Параметры:
//  ОписаниеПредставления - Структура - Описание. См. НовоеОписаниеПредставления
//  Имя - Строка - Имя параметра
//  Тип - ОписаниеТипов, Тип - Тип параметра
//  Значение - Неопределено, Булево, Строка, Число, Дата - Значение
//  Обязательный - Булево - Обязательность параметра
//  ЗначениеЭтоВыражение - Булево - Признак, что строковое значение параметра представляет собой выражение языка запросов
//	ДоступныеЗначения - СписокЗначений Из ЭлементСпискаЗначений, Неопределено - Доступные значения параметра для выбора пользователем
//  Описание - Строка - Подробное текстовое описание параметра
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - Добавить параметр представления
//@skip-check method-too-many-params
Функция ДобавитьПараметрПредставления(ОписаниеПредставления,
									  Имя,
									  Тип,
									  Значение = Неопределено,
									  Обязательный = Ложь,
									  ЗначениеЭтоВыражение = Ложь,
									  ДоступныеЗначения = Неопределено,
									  Описание = "")

	ИмяФункции = "ДобавитьПараметрПредставления";

	МодульОбщегоНазначенияКлиентСервер = МодульОбщегоНазначенияКлиентСервер();
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "ОписаниеПредставления",
														 ОписаниеПредставления,
														 Тип("Структура"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Имя", Имя, Тип("Строка"));
	Если Значение <> Неопределено Тогда
		МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
															 "Значение",
															 Значение,
															 ОписаниеТипаВсеТипыПараметраПредставления());
	КонецЕсли;
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Обязательный", Обязательный, Тип("Булево"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "ЗначениеЭтоВыражение",
														 ЗначениеЭтоВыражение,
														 Тип("Булево"));

	ДопустимыеТипыПараметраТип = Новый Массив;
	ДопустимыеТипыПараметраТип.Добавить(Тип("ОписаниеТипов"));
	ДопустимыеТипыПараметраТип.Добавить(Тип("Тип"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Тип", Тип, ДопустимыеТипыПараметраТип);
	
	Параметр = ОписаниеПредставления.ДоступныеПараметры.Добавить();
	Параметр.Имя = Имя;
	Параметр.Значение = Значение;
	Параметр.Обязательный = Обязательный;
	Параметр.Описание = Описание;
	Параметр.ЗначениеЭтоВыражение = ЗначениеЭтоВыражение;
	Параметр.ДоступныеЗначения = ДоступныеЗначения;

	Если ТипЗнч(Тип) = Тип("Тип") Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип);
		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		Параметр.Тип = ОписаниеТипа;
	Иначе
		Параметр.Тип = Тип;
	КонецЕсли;
	
	Возврат Параметр;

КонецФункции

// Добавляет новое поле в описание представления.
//
// Параметры:
//   ОписаниеПредставления - Структура - объект, содержащий описание представления
//   Имя - Строка - имя добавляемого поля
//   Выражение - Строка - выражение, связанное с добавляемым полем
//   ПолныйПуть - Строка - полный путь к полю (необязательно)
//   Описание - Строка - описание поля (необязательно)
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - добавленное поле
Функция ДобавитьПолеПредставления(ОписаниеПредставления, Имя, Выражение, ПолныйПуть = "", Описание = "")

	ИмяФункции = "ДобавитьПолеПредставления";
	
	МодульОбщегоНазначенияКлиентСервер = МодульОбщегоНазначенияКлиентСервер();
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
												   "ОписаниеПредставления",
												   ОписаниеПредставления,
												   Тип("Структура"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Имя", Имя, Тип("Строка"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Выражение", Выражение, Тип("Строка"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "ПолныйПуть", ПолныйПуть, Тип("Строка"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Описание", Описание, Тип("Строка"));

	Поле = ОписаниеПредставления.ДоступныеПоля.Добавить();
	Поле.Имя = Имя;
	Поле.Выражение = Выражение;
	Поле.ПолныйПуть = ПолныйПуть;
	Поле.Описание = Описание;

	Возврат Поле;

КонецФункции

// Удаляет поле представления из доступных полей по указанному имени.
//
// Параметры:
//   Описание - См. НовоеОписаниеПредставления
//   Имя - Строка - имя поля представления, которое необходимо удалить
Процедура УдалитьПолеПредставления(Описание, Имя)

	ПолеПредставления = Описание.ДоступныеПоля.Найти(Имя, "Имя");
	Если ПолеПредставления <> Неопределено Тогда
		Описание.ДоступныеПоля.Удалить(ПолеПредставления);
	КонецЕсли;

КонецПроцедуры

// Добавляет параметр "ТолькоРазрешенные" в описание представления.
//
// Параметры:
//   Описание - Структура - Описание представления, в которое добавляется параметр
Процедура ДобавитьПараметрТолькоРазрешенные(Описание)
	ДобавитьПараметрПредставления(Описание, ИмяПараметраТолькоРазрешенные(), ОписаниеТипаБулево(), Ложь);
КонецПроцедуры

#Область РаботаСПрограммнымИнтерфейсомПредставлений

Функция ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, ИмяПараметра, Обязательный = Ложь, РазрешитьУдалениеСтрокиСПустымПараметром = Истина, ДоступныйПараметр = Неопределено)
	
	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  ?(ДоступныйПараметр = Неопределено,
														ИмяПараметра,
														ДоступныйПараметр),
													  Обязательный,
													  ,
													  РазрешитьУдалениеСтрокиСПустымПараметром);
													  
	Возврат Параметр;
	
КонецФункции

Функция ДобавитьПараметрИменаПолейПрограммногоИнтерфейса(Описание, ИмяПараметра, Обязательный = Ложь)

	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  ,
													  Обязательный,
													  ВидыПараметровПрограммногоИнтерфейса().ИменаПолей);

	Возврат Параметр;

КонецФункции

Функция ДобавитьПараметрОтборыПрограммногоИнтерфейса(Описание, ИмяПараметра = "Отборы")

	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  ,
													  ,
													  ВидыПараметровПрограммногоИнтерфейса().Отборы);

	Возврат Параметр;

КонецФункции

Функция ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание, Обязательный = Истина, ИмяПараметра = "Фильтр")

	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  ,
													  Обязательный,
													  ВидыПараметровПрограммногоИнтерфейса().Фильтр);

	Возврат Параметр;

КонецФункции

Функция ДобавитьПараметрПсевдонимыПолейСКДПрограммногоИнтерфейса(Описание, ИмяПараметра = "ПсевдонимыПолейСКД")

	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  "ПсевдонимыПолейСКД",
													  ,
													  ВидыПараметровПрограммногоИнтерфейса().ПсевдонимыПолейСКД);

	Возврат Параметр;

КонецФункции

Функция ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание, Обязательный = Ложь, ИмяПараметра = "ТолькоРазрешенные")

	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  ИмяПараметраТолькоРазрешенные(),
													  Обязательный);

	Возврат Параметр;

КонецФункции

Функция ДобавитьПараметрИсточникДанныхПрограммногоИнтерфейса(Описание, ИмяПараметра)

	Параметр = ДобавитьПараметрПрограммногоИнтерфейса(Описание,
													  ИмяПараметра,
													  ,
													  Истина,
													  ВидыПараметровПрограммногоИнтерфейса().ИсточникДанных);

	Возврат Параметр;

КонецФункции

Функция ИмяПараметраТолькоРазрешенные()
	Возврат "ТолькоРазрешенные";
КонецФункции

Функция ДобавитьПараметрПрограммногоИнтерфейса(ОписаниеПредставления,
											   Имя,
											   ДоступныйПараметр = "",
											   Обязательный = Ложь,
											   Вид = Неопределено,
											   РазрешитьУдалениеСтрокиСПустымПараметром = Истина)
	
	ИмяФункции = "ДобавитьПараметрПрограммногоИнтерфейса";
	
	МодульОбщегоНазначенияКлиентСервер = МодульОбщегоНазначенияКлиентСервер();
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "ОписаниеПредставления",
														 ОписаниеПредставления,
														 Тип("Структура"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Имя", Имя, Тип("Строка"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "ДоступныйПараметр",
														 ДоступныйПараметр,
														 Тип("Строка"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "Вид",
														 Вид,
														 МодульОбщегоНазначенияКлиентСервер.МассивЗначений(Тип("Строка"),
																										   Тип("Неопределено")));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Обязательный", Обязательный, Тип("Булево"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "РазрешитьУдалениеСтрокиСПустымПараметром",
														 РазрешитьУдалениеСтрокиСПустымПараметром,
														 Тип("Булево"));
	
	Параметр = НовоеОписаниеПараметраПрограммногоИнтерфейса();
	Параметр.Имя = Имя;
	Параметр.Обязательный = Обязательный;
	Параметр.ДоступныйПараметр = ДоступныйПараметр;
	Параметр.УдалятьСтрокуСПустымПараметром = РазрешитьУдалениеСтрокиСПустымПараметром;
	
	Если Вид <> Неопределено Тогда
		Параметр.Вид = Вид;
	КонецЕсли;
	
	ОписаниеПредставления.ПрограммныйИнтерфейс.Параметры.Добавить(Параметр);	
	
	Возврат Параметр;
	
КонецФункции

// Создает новое описание параметра программного интерфейса.
//
// Возвращаемое значение:
//   Структура:
//     * Имя - Строка - имя параметра
//     * Вид - Строка, Неопределено - См. ВидыПараметровПрограммногоИнтерфейса
//     * Обязательный - Булево - признак обязательности заполнения параметра
//     * ДоступныйПараметр - Неопределено, Строка - Связь с См. НовоеОписаниеПредставления().ДоступныеПараметры. Имя доступного параметра. 
//	   * Значение - Произвольный, Неопределено - Значение параметра
//
Функция НовоеОписаниеПараметраПрограммногоИнтерфейса()

	Описание = Новый Структура;
	Описание.Вставить("Имя", "");
	Описание.Вставить("Вид", ВидыПараметровПрограммногоИнтерфейса().Прочее);
	Описание.Вставить("Обязательный", Ложь);
	Описание.Вставить("ДоступныйПараметр", Неопределено);
	Описание.Вставить("Значение", Неопределено);
	Описание.Вставить("УдалятьСтрокуСПустымПараметром", Истина);
	
	Возврат Описание;

КонецФункции

// Возвращает соответствие видов параметров программного интерфейса их идентификаторам.
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Виды параметров:
//     * ИменаПолей - Строка - идентификатор вида параметра "Имена полей"
//     * Фильтр - Строка - идентификатор вида параметра "Фильтр"
//     * ИсточникДанных - Строка - идентификатор вида параметра "Источник данных"
//     * ПсевдонимыПолейСКД - Строка - идентификатор вида параметра "Псевдонимы полей СКД"
//     * Отборы - Строка - идентификатор вида параметра "Отборы"
//	   * Прочее - Неопределено - Прочие параметры
//
Функция ВидыПараметровПрограммногоИнтерфейса() Экспорт
	
	Виды = Новый Структура;
	Виды.Вставить("Фильтр", "Фильтр");
	Виды.Вставить("ИменаПолей", "ИменаПолей");
	Виды.Вставить("ИсточникДанных", "ИсточникДанных");
	Виды.Вставить("ПсевдонимыПолейСКД", "ПсевдонимыПолейСКД");
	Виды.Вставить("Отборы", "Отборы");
	Виды.Вставить("Прочее", Неопределено);
	
	Возврат Новый ФиксированнаяСтруктура(Виды);
	
КонецФункции

#КонецОбласти

// Возвращает описание типа, включающее булево и строку.
//
// Возвращаемое значение:
//   ОписаниеТипов - описание типа, которое может быть булево или строка
Функция ОписаниеТипаБулево()
	Типы = Новый Массив; // Массив Из Тип
	Типы.Добавить(Тип("Булево"));
	Типы.Добавить(Тип("Строка"));

	Возврат Новый ОписаниеТипов(Типы);
КонецФункции

// Возвращает описание типа "Строка".
//
// Возвращаемое значение:
//   ОписаниеТипов - описание типа "Строка"
Функция ОписаниеТипаСтрока()
	Возврат Новый ОписаниеТипов("Строка");
КонецФункции

// Возвращает описание типа данных для представления даты.
//
// Возвращаемое значение:
//   ОписаниеТипов - описание типа данных, включающее типы "Дата" и "Строка"
Функция ОписаниеТипаДата()
	Типы = Новый Массив; // Массив Из Тип
	Типы.Добавить(Тип("Дата"));
	Типы.Добавить(Тип("Строка"));

	Возврат Новый ОписаниеТипов(Типы);
КонецФункции

// Возвращает описание типа, включающее все возможные типы параметра представления.
//
// Возвращаемое значение:
//   ОписаниеТипов - описание типа, которое включает типы: Дата, Строка, Булево, Число
Функция ОписаниеТипаВсеТипыПараметраПредставления() Экспорт
	Типы = Новый Массив; // Массив Из Тип
	Типы.Добавить(Тип("Дата"));
	Типы.Добавить(Тип("Строка"));
	Типы.Добавить(Тип("Булево"));
	Типы.Добавить(Тип("Число"));

	Возврат Новый ОписаниеТипов(Типы);
КонецФункции

#КонецОбласти

#Область ПодготовкаОписаниеПредставлений

// Формирует исполняемый текст запроса представлений для которых не требуется
// указывать выбираемые поля.
// 
// Параметры:
//  ИмяПредставления - Строка - Имя представления
//  ОбязательныеПараметры - Массив из Строка, Строка - Обязательные параметры для представления, без указания которых
//  												   текст запроса не может быть сформирован
// 
// Возвращаемое значение:
//  Строка - Исполняемый текст запроса представления
//
Функция СформироватьЗапросПредставления(ИмяПредставления, Знач ОбязательныеПараметры = "")

	ТекстЗапроса =
	"ВЫБРАТЬ ФЕЙК
	|	""Псевдополе"" КАК Псевдополе
	|ПОМЕСТИТЬ Представления_ИмяПредставления
	|ИЗ
	|	ВТ КАК ВТ
	|&ОбязательныеПараметры";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяПредставления", ИмяПредставления);

	Если ТипЗнч(ОбязательныеПараметры) = Тип("Строка") Тогда
		ОбязательныеПараметры = СтрРазделить(ОбязательныеПараметры, ",", Ложь);
	КонецЕсли;

	Если ОбязательныеПараметры.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбязательныеПараметры", "");
	Иначе
		УсловияОтбора = СтрСоединить(ОбязательныеПараметры, " = &ПсевдоПараметр" + Символы.ПС + "И ")
						+ " = &ПсевдоПараметр";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбязательныеПараметры", "ГДЕ" + Символы.ПС + УсловияОтбора);
	КонецЕсли;

	МодульЗарплатаКадрыОбщиеНаборыДанных = МодульОбщегоНазначения().ОбщийМодуль("ЗарплатаКадрыОбщиеНаборыДанных");
	МодульЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьЗапросыКПредставлениямВиртуальныхТаблиц(ТекстЗапроса);

	Если СтрНайти(ТекстЗапроса, "ФЕЙК") > 0 Тогда 
		// Замена не произошла. Например, по функциональным опциям/подсистемам представление недоступно.
		ТекстЗапроса = "";
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

// Разбирает описание доступных полей, предоставляемые типовой подсистемой и добавляет
// к описанию в формате этой обработки.
// Пример типового описания см. КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников()
// 
// Параметры:
//  ПоляПредставлений - Массив Из Структура - Поля представлений. см. КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников()
//  Описание - См. НовоеОписаниеПредставления
//  КонтрольУникальности - Булево - Признак контроля добавления полей, которые были ранее добавлены.
//  								Если Истина, то такие поля будут проигнорированы
Процедура ПоляПредставленийЗарплатаКадрыВДоступныеПоляПредставления(ПоляПредставлений,
																	Описание,
																	КонтрольУникальности = Ложь)

	Для Каждого ОписаниеПоля Из ПоляПредставлений Цикл
		Если КонтрольУникальности И Описание.ДоступныеПоля.Найти(ОписаниеПоля.ИмяПоля, "Имя") <> Неопределено Тогда

			Продолжить;
		КонецЕсли;

		ДобавитьПолеПредставления(Описание,
								  ОписаниеПоля.ИмяПоля,
								  ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов,
								  ОписаниеПоля.ПутьПоляСКД);
	КонецЦикла;

КонецПроцедуры

// Разбирает текст запроса и добавляет в доступные поля описания.
// Разбирает первый с конца запроса выбора, если не указано иное ИмяВТ.
// Текст запроса должен быть валидным для схемы запроса (открываться в конструкторе запроса).
// В процессе разбора определяются выражения пустых значений. При этом, если в колонка составного типа,
// то тип определяется по первому:
//  Ссылочный - ЗНАЧЕНИЕ(Тип.ПустаяСсылка)
//  Число - ВЫРАЗИТЬ(0 КАК ЧИСЛО()) если указана разрядность иначе 0
//  Булево - ЛОЖЬ
//  Дата - ДАТАВРЕМЯ(1, 1, 1)
//  Все остальные случаи - НЕОПРЕДЕЛЕНО
// 
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//  Описание - См. НовоеОписаниеПредставления
//  ИмяВТ - Неопределено, Строка - Имя ВТ
//  КонтрольУникальности - Булево - Признак контроля добавления полей, которые были ранее добавлены.
//  								Если Истина, то такие поля будут проигнорированы
Процедура ПоляЗапросаВДоступныеПоляПредставления(ТекстЗапроса,
												 Описание,
												 ИмяВТ = Неопределено,
												 КонтрольУникальности = Ложь) Экспорт

	ИмяФункции = "ПоляЗапросаВДоступныеПоляПредставления";
	МодульОбщегоНазначенияКлиентСервер = МодульОбщегоНазначенияКлиентСервер();
	
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "ТекстЗапроса", ТекстЗапроса, Тип("Строка"));
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "Описание", Описание, Тип("Структура"));
	Если ИмяВТ <> Неопределено Тогда
		МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции, "ИмяВТ", ИмяВТ, Тип("Строка"));
	КонецЕсли;
	МодульОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункции,
														 "КонтрольУникальности",
														 КонтрольУникальности,
														 Тип("Булево"));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ГраницаПакетаЗапросов = СхемаЗапроса.ПакетЗапросов.Количество() - 1;

	Для Индекс = 0 По ГраницаПакетаЗапросов Цикл
		ЗапросСхемыЗапроса = СхемаЗапроса.ПакетЗапросов[ГраницаПакетаЗапросов - Индекс];

		Если ТипЗнч(ЗапросСхемыЗапроса) <> Тип("ЗапросВыбораСхемыЗапроса") Тогда
			Продолжить;
		КонецЕсли;

		Если ИмяВТ <> Неопределено И ВРег(ЗапросСхемыЗапроса.ТаблицаДляПомещения) <> ВРег(ИмяВТ) Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого КолонкаСхемыЗапроса Из ЗапросСхемыЗапроса.Колонки Цикл
			Если ТипЗнч(КолонкаСхемыЗапроса) <> Тип("КолонкаСхемыЗапроса") Тогда
				Продолжить;
			КонецЕсли;
			
			Если КонтрольУникальности И Описание.ДоступныеПоля.Найти(КолонкаСхемыЗапроса.Псевдоним,
																	 "Имя") <> Неопределено Тогда

				Продолжить;
			КонецЕсли;
			
			ПустоеЗначение = ВыражениеПустогоЗначенияПоКолонкеСхемыЗапроса(КолонкаСхемыЗапроса);
			ДобавитьПолеПредставления(Описание, КолонкаСхемыЗапроса.Псевдоним, ПустоеЗначение);
		КонецЦикла;

		Прервать; // Прерываем цикл после обработки первого подходящего запроса
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОписанияПредставленийКонфигурации

// Добавляет описания базовых представлений в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_Базовые(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПодсистемы = "Общие";
	Обязательный = Истина;
	ЭтоВыражение = Истина;

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "Периоды";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрПредставления(Описание,
								  "НачалоИнтервала",
								  ОписаниеТипаДата(),
								  "&НачалоПериода",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ОкончаниеИнтервала",
								  ОписаниеТипаДата(),
								  "&ОкончаниеПериода",
								  Обязательный,
								  ЭтоВыражение);
	ДоступныеЗначенияПериодичности = Новый СписокЗначений;
	ДоступныеЗначенияПериодичности.Добавить("ГОД", "Год");
	ДоступныеЗначенияПериодичности.Добавить("КВАРТАЛ", "Квартал");
	ДоступныеЗначенияПериодичности.Добавить("МЕСЯЦ", "Месяц");
	ДоступныеЗначенияПериодичности.Добавить("ДЕНЬ", "День");
	ДобавитьПараметрПредставления(Описание,
								  "Периодичность",
								  ОписаниеТипаСтрока(),
								  "МЕСЯЦ",
								  ,
								  ,
								  ДоступныеЗначенияПериодичности);
	ДобавитьПараметрПредставления(Описание, "ИспользоватьКонецПериода", ОписаниеТипаБулево(), Ложь);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя,
																		   "НачалоИнтервала,ОкончаниеИнтервала"),
										   Описание);
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(
		|	МенеджерВременныхТаблиц,
		|	<НачалоИнтервала>,
		|	<ОкончаниеИнтервала>,
		|	<Периодичность>,
		|	""ВТПериоды"",
		|	<ИспользоватьКонецПериода>);";
		
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "НачалоИнтервала", Обязательный, Ложь);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ОкончаниеИнтервала", Обязательный, Ложь);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Периодичность", Ложь);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ИспользоватьКонецПериода", Ложь);
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СрезПоследних";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	Описание.ЕстьИсточникДанных = Истина;
	Описание.ДоступныОтборы = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "ПсевдонимыПолейСКД", ОписаниеТипаСтрока(), "");
	ДобавитьПараметрПредставления(Описание,
								  "ПараметрыПостроения_ФормироватьСПериодичностьДень",
								  ОписаниеТипаБулево(),
								  Истина);
								  
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =	
		"ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		|	""<Фильтр>"", ""<ИзмеренияФильтра>"");
		|
		|ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		|ПараметрыПостроения.ФормироватьСПериодичностьДень = <ФормироватьСПериодичностьДень>;
		|<Отборы>
		|<ПсевдонимыПолейСКД>
		|
		|ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		|	""<ИмяРегистра>"",
		|	МенеджерВременныхТаблиц,
		|	<ТолькоРазрешенные>,
		|	ОписаниеФильтра,
		|	ПараметрыПостроения,
		|	""ВТ<ИмяРегистра>"");";
		
	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрОтборыПрограммногоИнтерфейса(Описание, "Отборы");
	ДобавитьПараметрПсевдонимыПолейСКДПрограммногоИнтерфейса(Описание, "ПсевдонимыПолейСКД");
	ДобавитьПараметрИсточникДанныхПрограммногоИнтерфейса(Описание, "ИмяРегистра");
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание,
												   "ФормироватьСПериодичностьДень",
												   ,
												   ,
												   "ПараметрыПостроения_ФормироватьСПериодичностьДень");
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// Для совместимости с УИ
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Описание = МодульОбщегоНазначенияКлиентСервер().СкопироватьРекурсивно(Описание);
	Описание.Имя = "СрезПервых";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		|	""<Фильтр>"", ""<ИзмеренияФильтра>"");
		|
		|ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		|ПараметрыПостроения.ФормироватьСПериодичностьДень = <ФормироватьСПериодичностьДень>;
		|<Отборы>
		|<ПсевдонимыПолейСКД>
		|
		|ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПервых(
		|	""<ИмяРегистра>"",
		|	МенеджерВременныхТаблиц,
		|	<ТолькоРазрешенные>,
		|	ОписаниеФильтра,
		|	ПараметрыПостроения,
		|	""ВТ<ИмяРегистра>"");";
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// Для совместимости с УИ
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Описание = МодульОбщегоНазначенияКлиентСервер().СкопироватьРекурсивно(Описание);
	Описание.Имя = "ТаблицаРегистра";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрПредставления(Описание,
								  "ПараметрыПостроения_ВключатьЗаписиНаНачалоПериода",
								  ОписаниеТипаБулево(),
								  Ложь);
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		|	""<Фильтр>"", ""<ИзмеренияФильтра>"");
		|
		|ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
		|ПараметрыПостроения.ФормироватьСПериодичностьДень = <ФормироватьСПериодичностьДень>;
		|<Отборы>
		|<ПсевдонимыПолейСКД>
		|
		|ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		|	""<ИмяРегистра>"",
		|	МенеджерВременныхТаблиц,
		|	<ТолькоРазрешенные>,
		|	ОписаниеФильтра,
		|	ПараметрыПостроения,
		|	""ВТ<ИмяРегистра>"");";

	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

	Если ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
		Описание = НовоеОписаниеПредставления();
		Описание.Имя = "СвойстваСтатейФинансирования";
		Описание.Подсистема = "ОтражениеЗарплатыВБухучете";
		ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
		ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	КонецЕсли;

КонецПроцедуры

// Добавляет описания представлений подсистемы АттестацииСотрудников в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_АттестацииСотрудников(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПриложения.АттестацииСотрудников") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "АттестацииСотрудников";
	Обязательный = Истина;
	ЭтоВыражение = Истина;
	
	// СотрудникиПодлежащиеАттестации
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СотрудникиПодлежащиеАттестации";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрПредставления(Описание,
								  "НачалоПериода",
								  ОписаниеТипаДата(),
								  "&НачалоПериода",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ОкончаниеПериода",
								  ОписаниеТипаДата(),
								  "&ОкончаниеПериода",
								  Обязательный,
								  ЭтоВыражение);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя,
																		   "НачалоПериода,ОкончаниеПериода"), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// РезультатыАттестацииСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "РезультатыАттестацииСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы КадровоеПланирование в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_КадровоеПланирование(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровоеПланирование")
		 Или Не ПолучитьФункциональнуюОпцию("ИспользоватьКадровоеПланирование") Тогда

		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "КадровоеПланирование";

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ПоказателиКадровогоПлана";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "СценарийОбязателен", ОписаниеТипаБулево(), Ложь);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);

	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы КадровыйУчет в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_КадровыйУчет(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.КадровыйУчет") Тогда
		Возврат;
	КонецЕсли;

	МодульКадровыйУчет = МодульОбщегоНазначения().ОбщийМодуль("КадровыйУчет");

	ИмяПодсистемы = "КадровыйУчет";
	Обязательный = Истина;
	ЭтоВыражение = Истина;
	
	// КадровыеДанныеСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "КадровыеДанныеСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	Описание.ДоступныОтборы = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "ФормироватьСПериодичностьДень", ОписаниеТипаБулево(), Истина);
	
	// Не все доступные поля представлены в описании, некоторые требуется добавлять вручную.
	// Данный запрос не может быть сформирован без указания конкретных полей, поэтому получить доступные поля
	// из текста запроса не представляется возможным.
	ДобавитьПолеПредставления(Описание, "Период", "ДАТАВРЕМЯ(1, 1, 1)");
	ДобавитьПолеПредставления(Описание, "Сотрудник", "ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	ДобавитьПолеПредставления(Описание, "ФизическоеЛицо", "ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)");
	ПоляПредставленийЗарплатаКадрыВДоступныеПоляПредставления(МодульКадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников(),
															  Описание,
															  Истина);
															  
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		|	МенеджерВременныхТаблиц,
		|	""<Фильтр>"");
		|
		|КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц,
		|												 <ТолькоРазрешенные>,
		|												 <КадровыеДанные>, ,
		|												 <ФормироватьСПериодичностьюДень>);";
	
	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрИменаПолейПрограммногоИнтерфейса(Описание, "КадровыеДанные", Обязательный);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание,
												   "ФормироватьСПериодичностьюДень",
												   ,
												   "ФормироватьСПериодичностьДень");
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// КадровыеДанныеФизическихЛиц
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "КадровыеДанныеФизическихЛиц";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	Описание.ДоступныОтборы = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПолеПредставления(Описание, "Период", "ДАТАВРЕМЯ(1, 1, 1)");
	ДобавитьПолеПредставления(Описание, "ФизическоеЛицо", "ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)");
	ПоляПредставленийЗарплатаКадрыВДоступныеПоляПредставления(МодульКадровыйУчет.ПоляПредставленийКадровыхДанныхФизическихЛиц(),
															  Описание,
															  Истина);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		|	МенеджерВременныхТаблиц,
		|	""<Фильтр>"");
		|
		|КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц,
		|												   <ТолькоРазрешенные>,
		|												   <КадровыеДанные>);";

	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрИменаПолейПрограммногоИнтерфейса(Описание, "КадровыеДанные", Обязательный);
	
	// РабочиеМестаСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "РабочиеМестаСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "Организация", ОписаниеТипаСтрока(), "&Организация", , ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "Подразделение", ОписаниеТипаСтрока(), "&Подразделение", , ЭтоВыражение);
	ПараметрыПостроения = МодульКадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице();
	ЗапросВТРабочиеМестаСотрудников = МодульКадровыйУчет.ЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(Истина,
																										   "ВТ",
																										   ПараметрыПостроения);
	ПоляЗапросаВДоступныеПоляПредставления(ЗапросВТРабочиеМестаСотрудников.Текст, Описание);
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ПараметрыПостроения = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(
		|	ИмяВТСотрудникиПериоды = ""<Фильтр>"",
		|	ИмяПоляСотрудник = ""Сотрудник"",
		|	ИмяПоляНачалоПериода = ""НачалоПериода"",
		|	ИмяПоляОкончаниеПериода = ""ОкончаниеПериода"");
		|
		|ПараметрыПостроения.Организация = <Организация>;
		|ПараметрыПостроения.Подразделение = <Подразделение>;
		|
		|КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(МенеджерВременныхТаблиц,
		|											   <ТолькоРазрешенные>,
		|											   ПараметрыПостроения,
		|											   ""ВТРабочиеМестаСотрудников"");";
	
	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание, Обязательный);
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Организация");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Подразделение");
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// СотрудникиОрганизации
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СотрудникиОрганизации";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	Описание.ФильтрОбязателен = Ложь;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "Организация", ОписаниеТипаСтрока(), "&Организация", , ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "Подразделение", ОписаниеТипаСтрока(), "&Подразделение", , ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "ОтбиратьПоГоловнойОрганизации", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "НачалоПериода", ОписаниеТипаСтрока(), "&НачалоПериода", , ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ОкончаниеПериода",
								  ОписаниеТипаСтрока(),
								  "&ОкончаниеПериода",
								  ,
								  ЭтоВыражение);

	ДобавитьПолеПредставления(Описание, "Период", "ДАТАВРЕМЯ(1, 1, 1)");
	ДобавитьПолеПредставления(Описание, "Сотрудник", "ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	ДобавитьПолеПредставления(Описание, "ФизическоеЛицо", "ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)");
	// Доступны все кадровые данные для данной таблицы 
	ПоляПредставленийЗарплатаКадрыВДоступныеПоляПредставления(МодульКадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников(),
															  Описание,
															  Истина);
															  
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ПараметрыПостроения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
		|ПараметрыПостроения.Организация = <Организация>;
		|ПараметрыПостроения.Подразделение = <Подразделение>;
		|ПараметрыПостроения.ОтбиратьПоГоловнойОрганизации = <ОтбиратьПоГоловнойОрганизации>;
		|ПараметрыПостроения.НачалоПериода = <НачалоПериода>;
		|ПараметрыПостроения.ОкончаниеПериода = <ОкончаниеПериода>;
		|ПараметрыПостроения.КадровыеДанные = <КадровыеДанные>;
		|
		|КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц,
		|											<ТолькоРазрешенные>,
		|											ПараметрыПостроения,
		|											""ВТСотрудникиОрганизации"");";

	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Организация");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Подразделение");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ОтбиратьПоГоловнойОрганизации");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "НачалоПериода");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ОкончаниеПериода");
	ДобавитьПараметрИменаПолейПрограммногоИнтерфейса(Описание, "КадровыеДанные");
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);

	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// ПлановыеНачисленияСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ПлановыеНачисленияСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "ФормироватьСПериодичностьДень", ОписаниеТипаБулево(), Истина);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// ПлановыеУдержанияСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ПлановыеУдержанияСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// СтажиСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СтажиСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"КадровыйУчетРасширенный.СоздатьВТСтажиСотрудников(
		|	МенеджерВременныхТаблиц,
		|	<ТолькоРазрешенные>,
		|	""<Фильтр>"",
		|	""ВТСтажиСотрудников"");";
	
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание);

	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// ТекущаяКадроваяРасстановка
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ТекущаяКадроваяРасстановка";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "Дата", ОписаниеТипаСтрока(), "&Дата", Обязательный, ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "Организация", ОписаниеТипаСтрока(), "&Организация", , ЭтоВыражение);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя, "Дата"), Описание);
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"КадровыйУчетРасширенный.СоздатьВТТекущаяКадроваяРасстановка(
		|	МенеджерВременныхТаблиц,
		|	<Организация>,
		|	<Дата>);";
	
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Организация");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Дата", Обязательный);
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// ФункциональныеОпцииОрганизаций
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ФункциональныеОпцииОрганизаций";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПолеПредставления(Описание, "ИспользуютсяРаботыСДосрочнойПенсией", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользуетсяТрудСтудентовСтуденческихОтрядов", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользоватьРабочиеМестаОхраныТрудаКорпоративная", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользуетсяТрудЧленовЛетныхЭкипажей", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользуетсяТрудШахтеров", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользуетсяТрудФармацевтов", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользуетсяТрудЧленовЭкипажейМорскихСудов", "ЛОЖЬ");
	ДобавитьПолеПредставления(Описание, "ИспользуютсяРаботыСДосрочнойПенсией", "ЛОЖЬ");
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы КадровыйРезервГосслужащих в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_КадровыйРезервГосслужащих(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "КадровыйРезервГосслужащих";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезерв") Тогда
		Описание = НовоеОписаниеПредставления();
		Описание.Имя = "КадровыйРезервГосслужащих";
		Описание.Подсистема = ИмяПодсистемы;
		Описание.ЕстьФильтр = Истина;
		Описание.ФильтрОбязателен = Истина;
		Описание.Фильтр = "ВТОтборы";
		ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
		ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	КонецЕсли;

КонецПроцедуры

// Добавляет описания представлений подсистемы Медицина в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_Медицина(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "Медицина";

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СертификатыПоСпециальностиФизическихЛиц";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	Описание.ФильтрОбязателен = Истина;
	Описание.Фильтр = "ВТОсновныеСотрудники";
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СведенияОбАккредитацияхСпециалистов";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	Описание.ФильтрОбязателен = Истина;
	Описание.Фильтр = "ВТОсновныеСотрудники";
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы ОхранаТруда в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_ОхранаТруда(ОписанияПредставлений)

	МодульОбщегоНазначения = МодульОбщегоНазначения();

	Если Не МодульОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "ОхранаТруда";

	Обязательный = Истина;
	ЭтоВыражение = Истина;

	Если МодульОбщегоНазначения.ОбщийМодуль("РабочиеМестаОхраныТруда").РабочиеМестаОхраныТрудаИспользуются() Тогда

		Описание = НовоеОписаниеПредставления();
		Описание.Имя = "РабочиеМестаОхраныТруда";
		Описание.Подсистема = ИмяПодсистемы;
		ДобавитьПараметрТолькоРазрешенные(Описание);
		ДобавитьПараметрПредставления(Описание,
									  "ДатаАктуальности",
									  ОписаниеТипаСтрока(),
									  "&ДатаАктуальности",
									  Обязательный,
									  ЭтоВыражение);

		Если МодульОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
			ДобавитьПараметрПредставления(Описание, "ЭтоИнструктажи", Новый ОписаниеТипов("Булево"), Ложь);
			ДобавитьПараметрПредставления(Описание, "ЭтоМедосмотры", Новый ОписаниеТипов("Булево"), Ложь);
			ДобавитьПараметрПредставления(Описание, "ЭтоНесчастныеСлучаи", Новый ОписаниеТипов("Булево"), Ложь);
			ДобавитьПараметрПредставления(Описание, "ЭтоСОУТ", Новый ОписаниеТипов("Булево"), Ложь);
			ДобавитьПараметрПредставления(Описание, "ЭтоСИЗ", Новый ОписаниеТипов("Булево"), Ложь);
		КонецЕсли;

		ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);

		ОписанияПредставлений.Вставить(Описание.Имя, Описание);

	КонецЕсли;

КонецПроцедуры

// Добавляет описания представлений подсистемы ОстаткиОтпусков в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_ОстаткиОтпусков(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.ОстаткиОтпусков") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "ОстаткиОтпусков";

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ФактическиеОтпускаСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ОписательВТ = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТФактическиеОтпускаСотрудников(
		|	МенеджерВременныхТаблиц,
		|	""<ВФильтр>"",
		|	""Сотрудник,НачалоПериода,ОкончаниеПериода"",
		|	""ВТФактическиеОтпускаСотрудников"");
		|
		|ОстаткиОтпусков.СоздатьВТФактическиеОтпускаСотрудников(
		|	ОписательВТ,
		|	<ТолькоРазрешенные>);";
	
	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание);
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание, Истина);
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы ОтражениеЗарплатыВБухучете в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_ОтражениеЗарплатыВБухучете(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ОтражениеЗарплатыВБухгалтерскомУчетеРасширенная") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "ОтражениеЗарплатыВБухучете";

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "БухучетЗарплатыСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы ПодборПерсонала в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_ПодборПерсонала(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала")
		 Или Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда

		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "ПодборПерсонала";

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СведенияОКандидатах";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ЛичныеДанныеКандидатов";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "СтажПринятыхКандидатов";
	Описание.Подсистема = ИмяПодсистемы;
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы УправлениеШтатнымРасписанием в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_УправлениеШтатнымРасписанием(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.УправлениеШтатнымРасписанием") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "УправлениеШтатнымРасписанием";

	Обязательный = Истина;
	ЭтоВыражение = Истина;

	МодульУправлениеШтатнымРасписанием = МодульОбщегоНазначения().ОбщийМодуль("УправлениеШтатнымРасписанием");
		
	// Управление штатным расписанием
	Описание = НовоеОписаниеПредставления();
	Описание.Подсистема = ИмяПодсистемы;
	Описание.Имя = "ШтатноеРасписание";
	Описание.ЕстьФильтр = Истина;
	Описание.ФильтрОбязателен = Ложь;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание,
								  "ДатаАктуальности",
								  ОписаниеТипаДата(),
								  "&ДатаАктуальности",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "ВключатьНачисления", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ВключаяЗакрытые", ОписаниеТипаБулево(), Ложь);

	ПараметрыПостроения = МодульУправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание();
	ПараметрыПостроения.ДополнитьОписаниемНачислений = Истина;
	ПараметрыПостроения.ПолноеОписаниеНачислений = Истина;
	ПараметрыПостроения.Льготы = Истина;
	ПараметрыПостроения.УправленческиеНачисления = Истина;

	ЗапросВТШтатноеРасписание = МодульУправлениеШтатнымРасписанием.ЗапросВТШтатноеРасписание(Истина,
																							 ПараметрыПостроения);

	ПоляЗапросаВДоступныеПоляПредставления(ЗапросВТШтатноеРасписание.Текст, Описание);
	// Запрос формируется на основании другого экспортного метода, поэтому некоторые поля различаются и не могут
	// быть выбраны в представлении. Исключим такие поля, чтобы не возникало ошибки.
	ИсключаемыеПоля = "Льготы,ПлановыеНачисления,УправленческиеНачисления,"
					  + "ИдентификаторСтрокиВидаРасчета,РазмерМин,РазмерМакс,Размер";
	Для Каждого ИмяПоля Из СтрРазделить(ИсключаемыеПоля, ",") Цикл
		УдалитьПолеПредставления(Описание, ИмяПоля);
	КонецЦикла;
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписаниеПоТаблицеФильтра(
		|	""<Фильтр>"",
		|	ИмяПоляПериод = ""Период"",
		|	ИмяПоляПозицияШтатногоРасписания = ""ПозицияШтатногоРасписания"");
		|	
		|ПараметрыПостроения.ВключаяЗакрытые = <ВключаяЗакрытые>;
		|ПараметрыПостроения.ДополнитьОписаниемНачислений = <ДополнитьОписаниемНачислений>;
		|ПараметрыПостроения.ПолноеОписаниеНачислений = <ПолноеОписаниеНачислений>;
		|
		|УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		|	МенеджерВременныхТаблиц,
		|	<ТолькоРазрешенные>,
		|	ПараметрыПостроения);";

	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание, Обязательный);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ВключаяЗакрытые");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ДополнитьОписаниемНачислений", , "ВключатьНачисления");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ПолноеОписаниеНачислений", , "ВключатьНачисления");
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание, Обязательный);
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы УчетНачисленнойЗарплаты в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_УчетНачисленнойЗарплаты(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыРасширенная.УчетНачисленнойЗарплаты") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "УчетНачисленнойЗарплаты";

	МодульЗарплатаКадрыОбщиеНаборыДанных = МодульОбщегоНазначения().ОбщийМодуль("ЗарплатаКадрыОбщиеНаборыДанных");

	Обязательный = Истина;
	ЭтоВыражение = Истина;
	
	// Регистр, по которому выполняется запрос по отработанному времени, относится к подсистеме УчетНачисленнойЗарплаты,
	// а представление в общем модуле общих наборов.
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ОтработанноеВремя";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрПредставления(Описание,
								  "НачалоПериода",
								  ОписаниеТипаДата(),
								  "&НачалоПериода",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ОкончаниеПериода",
								  ОписаниеТипаДата(),
								  "&ОкончаниеПериода",
								  Обязательный,
								  ЭтоВыражение);
	ЗапросВТПредставленияОтработанноеВремя = МодульЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТПредставленияОтработанноеВремя("ВТ",
																														 '00010101',
																														 '00010101');
	ПоляЗапросаВДоступныеПоляПредставления(ЗапросВТПредставленияОтработанноеВремя.Текст, Описание);

	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "НачисленныеДоходыНДФЛ";
	Описание.Подсистема = ИмяПодсистемы;
	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);

	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

// Добавляет описания представлений подсистемы УчетБюджетныхУчреждений в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_УчетБюджетныхУчреждений(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "УчетБюджетныхУчреждений";

	Если ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		Описание = НовоеОписаниеПредставления();
		Описание.Имя = "СвойстваСтатейФинансирования";
		Описание.Подсистема = ИмяПодсистемы;
		ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя), Описание);
		ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	КонецЕсли;

КонецПроцедуры

// Добавляет описания представлений подсистемы УчетРабочегоВремени в коллекцию описаний представлений.
//
// Параметры:
//   ОписанияПредставлений - Соответствие Из КлючИЗначение - Коллекция, в которую будут добавлены описания представлений.
Процедура ДобавитьОписанияПредставлений_УчетРабочегоВремени(ОписанияПредставлений)

	Если Не МодульОбщегоНазначения().ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.УчетРабочегоВремени") Тогда
		Возврат;
	КонецЕсли;

	ИмяПодсистемы = "УчетРабочегоВремени";

	Обязательный = Истина;
	ЭтоВыражение = Истина;

	// ДанныеУчетаРабочегоВремениСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ДанныеУчетаРабочегоВремениСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "ДатаНачала", ОписаниеТипаДата(), "&ДатаНачала", Обязательный, ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ДатаОкончания",
								  ОписаниеТипаДата(),
								  "&ДатаОкончания",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "ПолучатьДанныеФакт", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ПолучатьДанныеПлан", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "ПолучатьДанныеНорма", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "Индексировать", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "ИспользоватьУжеРассчитанныеДанные", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ФормироватьПриНаличииРассчитанныхДанных", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ПолучатьУсловияТрудаИТерритории", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "УчитыватьТабельныеДанныеОТерриториях", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ПолучатьНормуВремениЗаПолныйМесяц", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "УчитыватьТолькоИндивидуальныеСведения", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "ОтноситьПереходящуюЧастьСменыКДнюНачала", ОписаниеТипаБулево(), Ложь);

	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя, "ДатаНачала,ДатаОкончания"),
										   Описание);
	
	Описание.ЕстьПрограммныйИнтерфейс = Истина;
	Описание.ПрограммныйИнтерфейс.Шаблон =
		"ПараметрыПолучения = УчетРабочегоВремениРасширенный.ПараметрыПолученияДанныхУчетаВремени();
		|ПараметрыПолучения.Индексировать  = <Индексировать>;
		|ПараметрыПолучения.ДатаНачала     = <ДатаНачала>;
		|ПараметрыПолучения.ДатаОкончания  = <ДатаОкончания>;
		|ПараметрыПолучения.ИмяВТСотрудники  = ""<Фильтр>"";
		|ПараметрыПолучения.ИмяВТРезультат   = ""ВТДанныеУчетаРабочегоВремениСотрудников"";
		|ПараметрыПолучения.ПолучатьДанныеФакт  = <ПолучатьДанныеФакт>;
		|ПараметрыПолучения.ПолучатьДанныеПлан  = <ПолучатьДанныеПлан>;
		|ПараметрыПолучения.ПолучатьДанныеНорма = <ПолучатьДанныеНорма>;
		|ПараметрыПолучения.ПолучатьУсловияТрудаИТерритории   = <ПолучатьУсловияТрудаИТерритории>;
		|ПараметрыПолучения.ПолучатьНормуВремениЗаПолныйМесяц = <ПолучатьНормуВремениЗаПолныйМесяц>;
		|ПараметрыПолучения.ИспользоватьУжеРассчитанныеДанные = <ИспользоватьУжеРассчитанныеДанные>;
		|ПараметрыПолучения.УчитыватьТабельныеДанныеОТерриториях    = <УчитыватьТабельныеДанныеОТерриториях>;
		|ПараметрыПолучения.УчитыватьТолькоИндивидуальныеСведения   = <УчитыватьТолькоИндивидуальныеСведения>;
		|ПараметрыПолучения.ФормироватьПриНаличииРассчитанныхДанных = <ФормироватьПриНаличииРассчитанныхДанных>;
		|ПараметрыПолучения.ОтноситьПереходящуюЧастьСменыКДнюНачала = <ОтноситьПереходящуюЧастьСменыКДнюНачала>;
		|
		|УчетРабочегоВремениРасширенный.СоздатьВТДанныеУчетаРабочегоВремениСотрудников(МенеджерВременныхТаблиц,
		|																			  <ТолькоРазрешенные>,
		|																			  ПараметрыПолучения);";

	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "Индексировать");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ДатаНачала");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ДатаОкончания");
	ДобавитьПараметрФильтрПрограммногоИнтерфейса(Описание);
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ПолучатьДанныеФакт");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ПолучатьДанныеПлан");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ПолучатьДанныеНорма");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ПолучатьУсловияТрудаИТерритории");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ПолучатьНормуВремениЗаПолныйМесяц");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ИспользоватьУжеРассчитанныеДанные");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "УчитыватьТабельныеДанныеОТерриториях");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "УчитыватьТолькоИндивидуальныеСведения");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ФормироватьПриНаличииРассчитанныхДанных");
	ДобавитьСвязьСПараметромПрограммногоИнтерфейса(Описание, "ОтноситьПереходящуюЧастьСменыКДнюНачала");
	ДобавитьПараметрТолькоРазрешенныеПрограммногоИнтерфейса(Описание);
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// ДанныеУчетаВремениИСостоянийСотрудников
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ДанныеУчетаВремениИСостоянийСотрудников";
	Описание.Подсистема = ИмяПодсистемы;
	Описание.ЕстьФильтр = Истина;

	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "ДатаНачала", ОписаниеТипаДата(), "&ДатаНачала", Обязательный, ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ДатаОкончания",
								  ОписаниеТипаДата(),
								  "&ДатаОкончания",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "МесяцДатаНачала",
								  ОписаниеТипаДата(),
								  "НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ)",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "МесяцДатаОкончания",
								  ОписаниеТипаДата(),
								  "КОНЕЦПЕРИОДА(&ДатаНачала, МЕСЯЦ)",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ДатаАктуальности",
								  ОписаниеТипаДата(),
								  "&ДатаАктуальности",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "Организация", ОписаниеТипаСтрока(), "&Организация", , ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "Подразделение", ОписаниеТипаСтрока(), "&Подразделение", , ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание, "РассчитыватьПлановоеВремя", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "ПолучатьУжеРассчитанныеДанные", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ПолучатьУсловияТрудаИТерритории", ОписаниеТипаБулево(), Ложь);
	ДобавитьПараметрПредставления(Описание, "ВыделятьВыходныеВПериодыОтклонений", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "УчитыватьТабельныеДанныеОТерриториях", ОписаниеТипаБулево(), Истина);
	ДобавитьПараметрПредставления(Описание, "ОтноситьПереходящуюЧастьСменыКДнюНачала", ОписаниеТипаБулево(), Ложь);

	ТекстЗапроса = СформироватьЗапросПредставления(Описание.Имя, "ДатаНачала,ДатаОкончания,МесяцДатаНачала,"
																 + "МесяцДатаОкончания,ДатаАктуальности");
	ПоляЗапросаВДоступныеПоляПредставления(ТекстЗапроса, Описание);

	ОписанияПредставлений.Вставить(Описание.Имя, Описание);
	
	// ПлановоеВремя
	Описание = НовоеОписаниеПредставления();
	Описание.Имя = "ПлановоеВремя";
	Описание.Подсистема = ИмяПодсистемы;
	ДобавитьПараметрТолькоРазрешенные(Описание);
	ДобавитьПараметрПредставления(Описание, "ДатаНачала", ОписаниеТипаДата(), "&ДатаНачала", Обязательный, ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ДатаОкончания",
								  ОписаниеТипаДата(),
								  "&ДатаОкончания",
								  Обязательный,
								  ЭтоВыражение);
	ДобавитьПараметрПредставления(Описание,
								  "ДатаАктуальности",
								  ОписаниеТипаДата(),
								  "&ДатаАктуальности",
								  Обязательный,
								  ЭтоВыражение);

	ПоляЗапросаВДоступныеПоляПредставления(СформироватьЗапросПредставления(Описание.Имя,
																		   "ДатаНачала,ДатаОкончания,ДатаАктуальности"),
										   Описание);
	
	ОписанияПредставлений.Вставить(Описание.Имя, Описание);

КонецПроцедуры

#КонецОбласти

#Область КонвертацияВJSON

// Преобразует описание представления в JSON-совместимую структуру.
//
// Параметры:
//  Описание - См. НовоеОписаниеПредставления
//
// Возвращаемое значение:
//  Структура - описание представления в JSON-совместимой структуре.
//
Функция ПредставлениеДляJSON(Описание)

	Результат = Новый Структура;
	Результат.Вставить("Подсистема", Описание.Подсистема);
	Результат.Вставить("Имя", Описание.Имя);
	Результат.Вставить("ЕстьИсточникДанных", Описание.ЕстьИсточникДанных);
	Результат.Вставить("ЕстьФильтр", Описание.ЕстьФильтр);
	Результат.Вставить("Фильтр", Описание.Фильтр);
	Результат.Вставить("ФильтрОбязателен", Описание.ФильтрОбязателен);
	Результат.Вставить("ДоступныОтборы", Описание.ДоступныОтборы);

	МассивПараметров = Новый Массив;
	Для Каждого СтрокаПараметра Из Описание.ДоступныеПараметры Цикл
		МассивПараметров.Добавить(ПараметрДляJSON(СтрокаПараметра));
	КонецЦикла;
	Результат.Вставить("ДоступныеПараметры", МассивПараметров);

	МассивПолей = Новый Массив;
	Для Каждого СтрокаПоля Из Описание.ДоступныеПоля Цикл
		МассивПолей.Добавить(ПолеДляJSON(СтрокаПоля));
	КонецЦикла;
	Результат.Вставить("ДоступныеПоля", МассивПолей);

	Возврат Результат;

КонецФункции

// Преобразует строку таблицы ДоступныеПараметры в JSON-совместимую структуру.
//
// Параметры:
//  СтрокаПараметра - СтрокаТаблицыЗначений - строка таблицы ДоступныеПараметры.
//
// Возвращаемое значение:
//  Структура - структура, совместимая с JSON.
//
Функция ПараметрДляJSON(СтрокаПараметра)

	Параметр = Новый Структура;
	Параметр.Вставить("Имя", СтрокаПараметра.Имя);
	Параметр.Вставить("Тип", ПредставлениеТипов(СтрокаПараметра.Тип));

	Если СтрокаПараметра.Значение = Неопределено Тогда
		Параметр.Вставить("Значение", Неопределено);
	Иначе
		Параметр.Вставить("Значение", СтрокаПараметра.Значение);
	КонецЕсли;

	Параметр.Вставить("Обязательный", СтрокаПараметра.Обязательный);
	Параметр.Вставить("ДоступныеЗначения", СписокЗначенийДляJSON(СтрокаПараметра.ДоступныеЗначения));
	Параметр.Вставить("ЗначениеЭтоВыражение", СтрокаПараметра.ЗначениеЭтоВыражение);

	Возврат Параметр;

КонецФункции

// Преобразует строку таблицы ДоступныеПоля в JSON-совместимую структуру.
//
// Параметры:
//  СтрокаПоля - СтрокаТаблицыЗначений - строка таблицы ДоступныеПоля.
//
// Возвращаемое значение:
//  Структура - структура, совместимая с JSON.
//
Функция ПолеДляJSON(СтрокаПоля)

	Поле = Новый Структура;
	Поле.Вставить("Имя", СтрокаПоля.Имя);
	Поле.Вставить("Выражение", СтрокаПоля.Выражение);

	Возврат Поле;

КонецФункции

// Преобразует ОписаниеТипов в массив строк с именами типов,
// как ожидает схема ("Тип": ["Строка"], ["СправочникСсылка.Организации"] и т.п.).
//
// Параметры:
//  ОписаниеТиповЗначения - ОписаниеТипов - описание типов.
//
// Возвращаемое значение:
//  Массив Из Строка - массив строк с именами типов.
//
Функция ПредставлениеТипов(ОписаниеТиповЗначения)

	МассивТипов = Новый Массив;

	Если ОписаниеТиповЗначения = Неопределено Тогда
		Возврат МассивТипов;
	КонецЕсли;

	Для Каждого Тип Из ОписаниеТиповЗначения.Типы() Цикл
		МассивТипов.Добавить(Строка(Тип));
	КонецЦикла;

	Возврат МассивТипов;

КонецФункции

// Преобразует СписокЗначений в массив структур {Значение, Представление}.
//
// Параметры:
//  СписокЗначений - СписокЗначений Из ЭлементСпискаЗначений - список значений.
//
// Возвращаемое значение:
//  Массив Из Структура - массив структур {Значение, Представление}.
//
Функция СписокЗначенийДляJSON(СписокЗначений)

	Результат = Новый Массив;

	Если СписокЗначений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого Элемент Из СписокЗначений Цикл
		Строка = Новый Структура;
		Строка.Вставить("Значение", Элемент.Значение);
		Строка.Вставить("Представление", Элемент.Представление);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Пишет подготовленную структуру в JSON-файл с отступами для читаемости.
//
// Параметры:
//  Структура - См. СтруктураДляJSON
//  ПутьКФайлу - Строка - полный путь к файлу.
//
Процедура ЗаписатьСтруктуруВJSONФайл(Структура, ПутьКФайлу)

	НастройкиЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, "  ");

	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл(ПутьКФайлу, , , НастройкиЗаписи);

	ЗаписатьJSON(Запись, Структура);

	Запись.Закрыть();

КонецПроцедуры

#КонецОбласти

#Область РаботаСЗапросом

// Конвертирует параметр представления таблицы формы Параметры для текста запроса представления
// 
// Параметры:
//  ВыбранныйПараметр - ДанныеФормыЭлементКоллекции - Выбранный параметр таблицы ПараметрыПредставления
//  РазделительПараметров - Строка - Разделитель параметров. В случае указания нескольких отборов, они должны
//  								 быть разделены постфиксом. Иначе при разботе текста представления будет использоваться
//  								 только последний.
// 
// Возвращаемое значение:
//  Строка - Параметр на языке запроса
Функция ВыбранныйПараметрВВыражениеЯзыкаЗапроса(ВыбранныйПараметр, РазделительПараметров = "")
	
	Значение = ?(ВыбранныйПараметр.ЗначениеЭтоВыражение,
				 ВыбранныйПараметр.Значение,
				 ЗначениеПараметраВВыражениеЯзыкаЗапроса(ВыбранныйПараметр.Значение));
	
	Если ВыбранныйПараметр.Отбор Тогда
		// Необходимо преобразовать в 3 отдельных отбора ЛевоеЗначение, ВидСравнения, ПравоеЗначение
		ШаблонОтбора = """ЛевоеЗначение%1"" = ""%2""
					   |	И ""ВидСравнения%1"" = %3
					   |	И ""ПравоеЗначение%1"" = %4";
		
		Возврат СтрШаблон(ШаблонОтбора,
						  РазделительПараметров,
						  ВыбранныйПараметр.Имя,
						  ЗначениеПараметраВВыражениеЯзыкаЗапроса(ВыбранныйПараметр.ВидСравнения),
						  Значение);
	Иначе				 
		Возврат СтрШаблон("""%1"" = %2", ВыбранныйПараметр.Имя, Значение);
	КонецЕсли;

КонецФункции

// Конвертирует значение в выражение на языке запроса
// 
// Параметры:
//  Значение - Булево, Строка, Дата, Число, ВидСравненияКомпоновкиДанных - Значение
// 
// Возвращаемое значение:
//  Строка - Значение параметра в выражение языка запроса
Функция ЗначениеПараметраВВыражениеЯзыкаЗапроса(Значение) Экспорт

	ТипЗначения = ТипЗнч(Значение);

	Если ТипЗначения = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ='""ДАТАВРЕМЯ(""yyyy, MM, dd, HH, mm, ss"")""';");
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧРД=.; ЧН=; ЧГ=;");
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат Формат(Значение, "БЛ=ЛОЖЬ; БИ=ИСТИНА;");
	ИначеЕсли ТипЗначения = Тип("ВидСравненияКомпоновкиДанных") Тогда
		СоответствиеВидовСравнений = ДоступныеВидыСравненияОтбора();

		ВыражениеЯзыкаЗапроса = СоответствиеВидовСравнений[Значение];
		Если ВыражениеЯзыкаЗапроса = Неопределено Тогда
			ВызватьИсключение "Недопустимый вид сравнения " + Значение;
		КонецЕсли;

		Возврат """" + ВыражениеЯзыкаЗапроса + """";
	КонецЕсли;

	Возврат """" + Строка(Значение) + """";

КонецФункции

// Разбирает на составные части полное имя представления, которое указывается после ключевого
// слова ПОМЕСТИТЬ
// 
// Параметры:
//  ПолноеИмя - Строка - Полное имя представления вида Представления_ИмяПредставления_<...>
// 
// Возвращаемое значение:
//  Структура - Разобрать полное имя представления:
// * Имя - Строка - Имя. Пустое, если не удалось разобрать
// * ИсточникДанных - Строка - Источник данных
// * Уточнение - Строка - Постфикс
Функция РазобратьПолноеИмяПредставления(ПолноеИмя)

	Результат = Новый Структура;
	Результат.Вставить("Имя", "");
	Результат.Вставить("ИсточникДанных", "");
	Результат.Вставить("Уточнение", "");

	Если ПустаяСтрока(ПолноеИмя) Тогда
		Возврат Результат;
	КонецЕсли;

	ЧастиПолногоИмени = СтрРазделить(ПолноеИмя, "_");
	
	Если ЧастиПолногоИмени.Количество() = 1 Тогда
		Если ВРег(ЧастиПолногоИмени[0]) <> ВРег("Представления") Тогда
			Результат.Имя = ЧастиПолногоИмени[0];
		КонецЕсли;

		Возврат Результат;
	КонецЕсли;

	Результат.Имя = ЧастиПолногоИмени[1];

	Если (ЭтоИмяПредставленияСИсточникомДанных(Результат.Имя)) И ЧастиПолногоИмени.Количество() > 3 Тогда
		ЗаполнитьЗначенияСвойств(Результат, РазобратьИмяПредставленияСИменемРегистра(ЧастиПолногоИмени));
	ИначеЕсли ЧастиПолногоИмени.Количество() >= 3 Тогда
		Результат.ИсточникДанных = ЧастиПолногоИмени[2];
		Если ЧастиПолногоИмени.Количество() > 3 Тогда
			МодульОбщегоНазначения = МодульОбщегоНазначения();
			МодульОбщегоНазначенияБЗККлиентСервер = МодульОбщегоНазначения.ОбщийМодуль(
				"ОбщегоНазначенияБЗККлиентСервер");
			ЧастиУточнения = МодульОбщегоНазначенияБЗККлиентСервер.СрезМассива(ЧастиПолногоИмени, 3);
			Результат.Уточнение = СтрСоединить(ЧастиУточнения, "_");
		КонецЕсли;
	Иначе
		// Обработка не требуется
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Проверяет, соответствует ли имя источника данных одному из стандартных имен представлений.
//
// Параметры:
//   Имя - Строка - Имя источника данных для проверки.
//
// Возвращаемое значение:
//   Булево - Истина, если имя соответствует "ТаблицаРегистра", "СрезПервых" или "СрезПоследних", иначе Ложь
Функция ЭтоИмяПредставленияСИсточникомДанных(Имя)
	Возврат ВРег(Имя) = ВРег("ТаблицаРегистра")
		  Или ВРег(Имя) = ВРег("СрезПервых")
		  Или ВРег(Имя) = ВРег("СрезПоследних");
КонецФункции

// Разбирает имя представления с именем регистра на составные части.
//
// Параметры:
//   ЧастиПолногоИмени - Массив Из Строка - части полного имени представления, разбитые по символу "_".
//
// Возвращаемое значение:
//   Структура - содержит имя представления, источник данных и уточнение:
//	   * ИсточникДанных - Строка - источник данных.
//	   * Уточнение - Строка - уточнение.
//
Функция РазобратьИмяПредставленияСИменемРегистра(ЧастиПолногоИмени)
	
	Результат = Новый Структура("ИсточникДанных, Уточнение", "", "", "");
	
	МодульОбщегоНазначения = МодульОбщегоНазначения();
	МодульОбщегоНазначенияБЗККлиентСервер = МодульОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБЗККлиентСервер");
	
	ИндексИмениРегистра = 2;
		
	// Представление может содержать в качестве источника данных регистр, который может иметь префиксацию с "_".
	// Также может содержать уточнение через "_". В таком случае необходим поиск по метаданным.
	Для Индекс = 0 По ЧастиПолногоИмени.ВГраница() - ИндексИмениРегистра Цикл
		ЧастиПроверяемогоИмени = МодульОбщегоНазначенияБЗККлиентСервер.СрезМассива(ЧастиПолногоИмени,
																				   ИндексИмениРегистра,
																				   ЧастиПолногоИмени.ВГраница()
																				   - Индекс);
		ПроверяемоеИмя = СтрСоединить(ЧастиПроверяемогоИмени, "_");
		Если Метаданные.РегистрыСведений.Найти(ПроверяемоеИмя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Результат.ИсточникДанных = ПроверяемоеИмя;
		Если Индекс > 0 Тогда
			ЧастиУточнения = МодульОбщегоНазначенияБЗККлиентСервер.СрезМассива(ЧастиПолногоИмени,
																			   ЧастиПолногоИмени.ВГраница()
																			   - Индекс
																			   + 1);

			Результат.Уточнение = СтрСоединить(ЧастиУточнения, "_");
		КонецЕсли;

		Прервать;
	КонецЦикла;

	Если ПустаяСтрока(Результат.ИсточникДанных) Тогда
		ЧастиИсточникаДанных = МодульОбщегоНазначенияБЗККлиентСервер.СрезМассива(ЧастиПолногоИмени, ИндексИмениРегистра);
		Результат.ИсточникДанных = СтрСоединить(ЧастиИсточникаДанных, "_");
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

